//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВызватьОбработчик(Обработчик, Результат = Неопределено, ПерезапускОбработчика = Ложь) Экспорт
	
	Если Обработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОбработчикОсновнойЦепочки = Обработчик.ДополнительныеПараметры <> Неопределено
		И ЮТТипыДанныхСлужебный.ЭтоСтруктура(ТипЗнч(Обработчик.ДополнительныеПараметры))
		И ЮТКоллекции.ЗначениеСтруктуры(Обработчик.ДополнительныеПараметры, "ЭтоОсновнаяЦепочкаИсполнения", Ложь);
	Если НЕ ПерезапускОбработчика И ЭтоОбработчикОсновнойЦепочки Тогда
		ЮТСостояниеИсполненияТестовСлужебный.ИнициализироватьСостояние(Обработчик, Обработчик.ДополнительныеПараметры, Результат);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Обработчик, Результат);
	
КонецПроцедуры

Процедура ВызватьСледующийОбработчик(ПараметрыИсполнения, Результат = Неопределено) Экспорт
	
	Обработчик = СледующийОбработчик(ПараметрыИсполнения);
	
	Если Обработчик <> Неопределено Тогда
		ЮТЛогирование.Отладка("Вызов обработчика исполнителя: " + Обработчик.ИмяПроцедуры);
		ВызватьОбработчик(Обработчик, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Следующий обработчик.
// 
// Параметры:
//  ПараметрыИсполнения - см. ЦепочкаАсинхроннойОбработки
// 
// Возвращаемое значение:
//  ОписаниеОповещения
Функция СледующийОбработчик(ПараметрыИсполнения) Экспорт
	
	ПараметрыИсполнения.ИндексСледующегоОбработчика = ПараметрыИсполнения.ИндексСледующегоОбработчика + 1;
	Если ПараметрыИсполнения.ИндексСледующегоОбработчика < ПараметрыИсполнения.Цепочка.Количество() Тогда
		Обработчик = ПараметрыИсполнения.Цепочка[ПараметрыИсполнения.ИндексСледующегоОбработчика];
	КонецЕсли;
	
	Возврат Обработчик;
	
КонецФункции

Функция ТекущийОбработчик(ПараметрыИсполнения) Экспорт
	
	Возврат ПараметрыИсполнения.Цепочка[ПараметрыИсполнения.ИндексСледующегоОбработчика];
	
КонецФункции

Процедура ДобавитьОбработчикЦепочки(ПараметрыИсполнения, Модуль, ИмяМетода) Экспорт
	
	Обработчик = Новый ОписаниеОповещения(ИмяМетода, Модуль, ПараметрыИсполнения, "ОбработчикОшибки", ЮТИсполнительСлужебныйКлиент);
	ПараметрыИсполнения.Цепочка.Добавить(Обработчик);
	
КонецПроцедуры

Функция ЦепочкаАсинхроннойОбработки() Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("ЭтоОсновнаяЦепочкаИсполнения", Ложь);
	Параметры.Вставить("Цепочка", Новый Массив());
	Параметры.Вставить("ИндексСледующегоОбработчика", -1);
	
	Возврат Параметры;
	
КонецФункции

Функция НовыйПустойОбработчик(КоличествоПараметров = 1) Экспорт
	
	МаксимальноеДопустимоеЧислоПараметров = 3;
	
	Если КоличествоПараметров >= 1 И КоличествоПараметров <= МаксимальноеДопустимоеЧислоПараметров Тогда
		Возврат Новый ОписаниеОповещения("ПустойОбработчик" + КоличествоПараметров, ЭтотОбъект);
	Иначе
		ВызватьИсключение СтрШаблон("Пустой обработчик с %1 параметрами не реализован", КоличествоПараметров);
	КонецЕсли;
	
КонецФункции

// BSLLS:MissingParameterDescription-off

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПустойОбработчик1(Параметр1) Экспорт
	
КонецПроцедуры

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПустойОбработчик2(Параметр1, Параметр2) Экспорт
	
КонецПроцедуры

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПустойОбработчик3(Параметр1, Параметр2, Параметр3) Экспорт
	
КонецПроцедуры
// BSLLS:MissingParameterDescription-on

Процедура ОтложенныйВызов(ИмяМетода, Интервал = 0.1) Экспорт
	
	ПодключитьОбработчикОжидания(ИмяМетода, Интервал, Истина);
	
КонецПроцедуры

#КонецОбласти
