//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ПоместитьФайлыВРабочийКаталог(Знач ПереданныеФайлы) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("РабочийКаталог", ФайлыПроектаРабочийКаталог());
	
	ЮТФайлы.СоздатьКаталогРекурсивно(Контекст.РабочийКаталог);
	
	КаталогПроекта = ЮТНастройкиВыполнения.КаталогПроекта();
	
	Для Каждого Файл Из ПереданныеФайлы Цикл
		
		ИмяФайла = ?(ЗначениеЗаполнено(Файл.ПолноеИмя), Файл.ПолноеИмя, Файл.Имя);
		ИмяВКаталоге = СтрЗаменить(ИмяФайла, КаталогПроекта, "");
		ПолноеИмя = ЮТФайлы.ОбъединитьПути(Контекст.РабочийКаталог, ИмяВКаталоге);
		
		ЮТФайлы.СоздатьРодительскийКаталог(ПолноеИмя);
		ПолучитьИзВременногоХранилища(Файл.Хранение).Записать(ПолноеИмя);
		
	КонецЦикла;
	
	Возврат Контекст;
	
КонецФункции

Функция ФабрикаXDTO(Знач КаталогСхем) Экспорт
	
	Каталог = ЮТест.Зависимость(ЮТЗависимости.ФайлыПроекта(КаталогСхем)).ПолноеИмя;
	
	ПостроительСхем = Новый ПостроительСхемXML();
	ПостроительDOM = Новый ПостроительDOM();
	НаборСхем = Новый НаборСхемXML();
	
	ФайлыСхем = НайтиФайлы(Каталог, "*.xsd", Истина);
	
	Для Каждого Файл Из ФайлыСхем Цикл
		
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.ОткрытьФайл(Файл.ПолноеИмя);
		Схема = ПостроительСхем.СоздатьСхемуXML(ПостроительDOM.Прочитать(ЧтениеXML).ЭлементДокумента);
		ЧтениеXML.Закрыть();
		Если Схема <> Неопределено Тогда
			НаборСхем.Добавить(Схема);
		КонецЕсли;
		
	КонецЦикла;
	
	Фабрика = Новый ФабрикаXDTO(НаборСхем);
	
	Результат = ЮТФабрикаСлужебный.РезультатРазрешенияЗависимости();
	Результат.Успешно = Фабрика <> Неопределено;
	
	Если Результат.Успешно Тогда
		Результат.СохраняемыйКонтекст = Новый Структура("Фабрика", Фабрика);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФайлыПроектаРабочийКаталог()
	
	КлючБазы = ЮТОбщийСлужебный.ХешMD5(СтрокаСоединенияИнформационнойБазы());
	
	Возврат ЮТФайлы.ОбъединитьПути(КаталогВременныхФайлов(), КлючБазы, "КаталогПроекта");
	
КонецФункции

#КонецОбласти
