//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыбратьСохраняемыйФайл(Фильтр, ИмяФайла, Оповещение) Экспорт
	
	ВыбратьФайл(РежимДиалогаВыбораФайла.Сохранение, Фильтр, ИмяФайла, Оповещение);
	
КонецПроцедуры

Процедура ВыбратьЗагружаемыйФайл(Фильтр, ИмяФайла, Оповещение) Экспорт
	
	ВыбратьФайл(РежимДиалогаВыбораФайла.Открытие, Фильтр, ИмяФайла, Оповещение);
	
КонецПроцедуры

Процедура ВыбратьКаталог(ИмяФайла, Оповещение) Экспорт
	
	ВыбратьФайл(РежимДиалогаВыбораФайла.ВыборКаталога, Неопределено, ИмяФайла, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение, ВыбранныеФайлы[0]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьФайл(Режим, Фильтр, ИмяФайла, Оповещение)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(Режим);
	
	Если ЗначениеЗаполнено(Фильтр) Тогда
		ДиалогВыбораФайла.Фильтр = Фильтр;
	КонецЕсли;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайла;
	
	ПараметрыОбработчика = Новый Структура("Оповещение", Оповещение);
	Обработчик = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект, ПараметрыОбработчика);
	ДиалогВыбораФайла.Показать(Обработчик);
	
КонецПроцедуры

#КонецОбласти
