//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ПараметрыЗапуска
//  Возвращает загруженные параметры запуска тестирования
// Параметры:
//  ПараметрыЗапускаСтрокой - Строка - Строка с параметрами запуска. 
//                                     Содержит ключ запуска и строку с конфигурационным файлом. 
//                                     Формат строки "RunUnitTests=/путь/к/конфигурационному/файлу", 
//                                     где ключ указывается обязательно, а путь - по желанию
//  Обработчик - ОписаниеОповещения
// 
// Возвращаемое значение:
//  см. ЮТФабрика.ПараметрыЗапуска
Функция ПараметрыЗапуска(Знач ПараметрыЗапускаСтрокой, Обработчик) Экспорт
	
	Попытка
		
		ПараметрыЗапускаПредприятия = ПараметрыЗапускаПредприятия(ПараметрыЗапускаСтрокой);
		Параметры = ПрочитатьПараметрыЗапуска(ПараметрыЗапускаПредприятия, Обработчик);
		
	Исключение
		
		ЮТРегистрацияОшибокСлужебный.ЗарегистрироватьОшибкуИнициализацииДвижка(ИнформацияОбОшибке(), "Ошибка чтения параметров запуска");
		Параметры = ЮТФабрика.ПараметрыЗапуска();
		
	КонецПопытки;
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыТестированияПоУмолчанию() Экспорт
	
	ПараметрыТестирования = ЮТФабрика.ПараметрыЗапуска();
	ЮТСобытияСлужебный.УстановитьПараметрыЗапускаПоУмолчанию(ПараметрыТестирования);
	
	Возврат ПараметрыТестирования;
	
КонецФункции

Функция КлючЗапуска() Экспорт
	
	Возврат "RunUnitTests";
	
КонецФункции

Функция ЕстьПараметрыЗапускаТестов() Экспорт
	
	Если ПустаяСтрока(ПараметрЗапуска) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыЗапускаПредприятия = ПараметрыЗапускаПредприятия(ПараметрЗапуска);
	Возврат ПараметрыЗапускаПредприятия.Получить(КлючЗапускаНРег()) <> Неопределено;
	
КонецФункции

Функция ПараметрыЗапускаИзФайла(ИмяФайла, Обработчик) Экспорт
	
	Параметры = Новый Соответствие;
	Параметры.Вставить(КлючЗапускаНРег(), ИмяФайла);
	Возврат ПрочитатьПараметрыЗапуска(Параметры, Обработчик);
	
КонецФункции

Функция ФайлПараметровЗапускаТестирования() Экспорт
	
	ПараметрыЗапускаПредприятия = ПараметрыЗапускаПредприятия(ПараметрЗапуска);
	ИмяФайла = ПараметрыЗапускаПредприятия.Получить(КлючЗапускаНРег());
	
	Если ЗначениеЗаполнено(ИмяФайла) И ТипЗнч(ИмяФайла) = Тип("Строка") Тогда
		Возврат ИмяФайла;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПрочитатьПараметрыЗапуска
// 	Читает параметры из строки запуска
// Параметры:
//  ПараметрыЗапускаПредприятия - Соответствие из Произвольный - Соответствие параметров запуска предприятия полученные из `ПараметрЗапуска`
//  Обработчик - ОписаниеОповещения
// 
// Возвращаемое значение:
//  см. ЮТФабрика.ПараметрыЗапуска
Функция ПрочитатьПараметрыЗапуска(ПараметрыЗапускаПредприятия, Обработчик)
	
	ПараметрыТестирования = ЮТФабрика.ПараметрыЗапуска();
	ЗагруженныеПараметрыТестирования = ПереданныеПараметрыТестирования(ПараметрыЗапускаПредприятия);
	
	ВыполнятьТестирование = ЮТКоллекции.ЗначениеСтруктуры(ЗагруженныеПараметрыТестирования, "ВыполнятьМодульноеТестирование", Ложь);
	
	Если ВыполнятьТестирование Тогда
		ЮТСобытияСлужебный.УстановитьПараметрыЗапускаПоУмолчанию(ПараметрыТестирования);
		ДополнитьПараметрыПрочитанными(ПараметрыТестирования, ЗагруженныеПараметрыТестирования);
	КонецЕсли;
	
	ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьОбработчик(Обработчик, Параметрытестирования);
	Возврат Параметрытестирования;
	
КонецФункции

Функция ПереданныеПараметрыТестирования(ПараметрыЗапускаПредприятия)
	
	ПараметрЗапускаТестов = ЮТКоллекции.ЗначениеСоответствия(ПараметрыЗапускаПредприятия, КлючЗапускаНРег(), Ложь);
	
	ТипПараметра = ТипЗнч(ПараметрЗапускаТестов);
	
	Если ТипПараметра = Тип("Булево") Тогда
		
		Параметры = Новый Структура("ВыполнятьМодульноеТестирование, showReport, closeAfterTests");
		Параметры.ВыполнятьМодульноеТестирование = ПараметрЗапускаТестов;
		Параметры.showReport = Истина;
		Параметры.closeAfterTests = Ложь;
		
	ИначеЕсли ТипПараметра <>  Тип("Строка") Или НЕ ЗначениеЗаполнено(ПараметрЗапускаТестов) Тогда
		
		Параметры = Новый Структура;
		
	Иначе
		
		Параметры = ПрочитатьКонфигурационныйФайл(ПараметрЗапускаТестов);
		Параметры.Вставить("ВыполнятьМодульноеТестирование", Истина);
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыЗапускаПредприятия(ПараметрыЗапускаСтрокой)
	
	ПарыКлючЗначение = ЮТСтроки.РазделитьСтроку(ПараметрыЗапускаСтрокой, ";");
	
	ПараметрыЗапускаПредприятия = Новый Соответствие;
	
	Для Каждого Пара Из ПарыКлючЗначение Цикл
		
		Если ПустаяСтрока(Пара) Тогда
			Продолжить;
		КонецЕсли;
		
		КлючЗначение = ЮТСтроки.РазделитьСтроку(Пара, "=");
		Ключ = НРег(КлючЗначение[0]);
		
		Если КлючЗначение.Количество() = 1 Тогда
			ПараметрыЗапускаПредприятия.Вставить(Ключ, Истина);
		Иначе
			ПараметрыЗапускаПредприятия.Вставить(Ключ, КлючЗначение[1]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПараметрыЗапускаПредприятия;
	
КонецФункции

Функция ПрочитатьКонфигурационныйФайл(ПутьКФайлу)
	
#Если НЕ ВебКлиент Тогда
	
	Если ЮТОбщий.УстановленБезопасныйРежим() Тогда
		ВызватьИсключение "Расширение подключено в безопасном режиме. Чтение конфигурационного файла недоступно";
	КонецЕсли;
	
	ДанныеФайла = Неопределено;
	
	Попытка
		
		Текст = ЮТФайлы.ДанныеТекстовогоФайла(ПутьКФайлу);
		
		Если ЗначениеЗаполнено(Текст) Тогда
			ДанныеФайла = ЮТОбщий.ЗначениеИзJSON(Текст);
		КонецЕсли;
		
	Исключение
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ДанныеФайла;
	
#Иначе
	// будут использованы параметры по умолчанию
	Возврат Новый Структура;
#КонецЕсли

КонецФункции

Процедура ДополнитьПараметрыПрочитанными(Параметры, ДанныеДополнения)
	
	Для Каждого Параметр Из ДанныеДополнения Цикл
		
		Если НЕ Параметры.Свойство(Параметр.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Параметры[Параметр.Ключ] = Параметр.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КлючЗапускаНРег()
	
	Возврат НРег(КлючЗапуска());
	
КонецФункции

#КонецОбласти
