//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

#Область НастройкиТеста

// Возвращает значение настройки "ВТранзакции" для текущего исполняемого объекта (тест, набор, модуль)
// 
// Возвращаемое значение:
//  Булево
Функция ВТранзакции() Экспорт
	
	ИмяПараметра = ЮТФабрика.ПараметрыИсполненияТеста().ВТранзакции;
	
	Возврат ЗначениеНастройкиТеста(ИмяПараметра, Ложь);
	
КонецФункции

// Возвращает значение настройки "УдалениеТестовыхДанных" для текущего исполняемого объекта (тест, набор, модуль)
// 
// Возвращаемое значение:
//  Булево
Функция УдалениеТестовыхДанных() Экспорт
	
	ИмяПараметра = ЮТФабрика.ПараметрыИсполненияТеста().УдалениеТестовыхДанных;
	
	Возврат ЗначениеНастройкиТеста(ИмяПараметра, Ложь);
	
КонецФункции

// Возвращает значение настройки "Перед" для текущего исполняемого объекта (тест, набор, модуль)
// Возвращает имя назначенного обработчика события (имя метода) "Перед".
// 
// Возвращаемое значение:
//  Строка
Функция Перед() Экспорт
	
	ИмяПараметра = ЮТФабрика.ПараметрыИсполненияТеста().Перед;
	
	Возврат ЗначениеНастройкиТеста(ИмяПараметра, "", Истина);
	
КонецФункции

// Возвращает значение настройки "После" для текущего исполняемого объекта (тест, набор, модуль)
// Возвращает имя назначенного обработчика события (имя метода) "После".
// 
// Возвращаемое значение:
//  Строка
Функция После() Экспорт
	
	ИмяПараметра = ЮТФабрика.ПараметрыИсполненияТеста().После;
	
	Возврат ЗначениеНастройкиТеста(ИмяПараметра, "", Истина);
	
КонецФункции

// Возвращает значение произвольной настройки для текущего исполняемого объекта (тест, набор, модуль)
// 
// Параметры:
//  ИмяНастройки - Строка - Имя настройки, см. ЮТФабрика.ПараметрыИсполненияТеста
//  ЗначениеПоУмолчанию - Произвольный - Значение по умолчанию
//  СтрогийУровеньИсполнения - Булево - Признак, стоит ли проверять наличие настройки у родительских элементов.
//  									Ложь - По умолчанию, будет выполнен поиск и получение значения для родителей (набор, модуль),
//  									       если значения для текущего элемента не установлено.
//  									Истина - Получение настройки только для текущего элемента.
// 
// Возвращаемое значение:
//  Произвольный, Неопределено, Булево, Строка - Значение настройки теста
Функция ЗначениеНастройкиТеста(ИмяНастройки, ЗначениеПоУмолчанию, СтрогийУровеньИсполнения = Ложь) Экспорт
	
	Значение = ЗначениеПоУмолчанию;
	КонтекстИсполнения = ЮТКонтекстСлужебный.КонтекстИсполнения();
	
	Если СтрогийУровеньИсполнения Тогда
		
		ТекущийКонтекстИсполнения = ЮТКонтекстСлужебный.КонтекстИсполненияТекущегоУровня();
		
		Если ТекущийКонтекстИсполнения <> Неопределено Тогда
			Значение = ЮТКоллекции.ЗначениеСтруктуры(ТекущийКонтекстИсполнения.НастройкиВыполнения, ИмяНастройки, ЗначениеПоУмолчанию);
		КонецЕсли;
		
	ИначеЕсли КонтекстИсполнения.Тест <> Неопределено И КонтекстИсполнения.Тест.НастройкиВыполнения.Свойство(ИмяНастройки) Тогда
		
		Значение = КонтекстИсполнения.Тест.НастройкиВыполнения[ИмяНастройки];
		
	ИначеЕсли КонтекстИсполнения.Набор <> Неопределено И КонтекстИсполнения.Набор.НастройкиВыполнения.Свойство(ИмяНастройки) Тогда
		
		Значение = КонтекстИсполнения.Набор.НастройкиВыполнения[ИмяНастройки];
		
	ИначеЕсли КонтекстИсполнения.Модуль <> Неопределено И КонтекстИсполнения.Модуль.НастройкиВыполнения.Свойство(ИмяНастройки) Тогда
		
		Значение = КонтекстИсполнения.Модуль.НастройкиВыполнения[ИмяНастройки];
		
	Иначе
		
		ГлобальныеНастройки = ЮТКонтекстСлужебный.ГлобальныеНастройкиВыполнения();
		
		Если ГлобальныеНастройки.Свойство(ИмяНастройки) Тогда
			Значение = ГлобальныеНастройки[ИмяНастройки];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область НастройкиСеанса

// Возвращает глобальные настройки выполнения, указанные в файле настроек запуска, объект`settings`
// 
// Возвращаемое значение:
//  Структура, Неопределено - Глобальные настройки
Функция ГлобальныеНастройкиВыполнения() Экспорт
	
	//@skip-check constructor-function-return-section
	Возврат ЮТКонтекстСлужебный.ГлобальныеНастройкиВыполнения();
	
КонецФункции

// Возвращает путь к каталогу проекта, указанному в файле настроек - `projectPath`
// 
// Возвращаемое значение:
//  Строка - Каталог проекта
Функция КаталогПроекта() Экспорт
	
	Возврат ЮТКонтекстСлужебный.ПараметрыЗапуска().projectPath;
	
КонецФункции

#КонецОбласти

#КонецОбласти
