//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Возвращает значение контекста
// 
// Параметры:
//  ИмяЗначения - Строка
// 
// Возвращаемое значение:
//  Произвольный - Сохраненное в контексте значение
Функция Значение(ИмяЗначения) Экспорт
	
	Уровень = ЮТКонтекстСлужебный.КонтекстИсполнения().Уровень;
	Уровни = ЮТФабрика.УровниИсполнения();
	
	КонтекстТеста = ЮТКонтекстСлужебный.КонтекстТеста();
	Если Уровень = Уровни.Тест И КонтекстТеста <> Неопределено И КонтекстТеста.Свойство(ИмяЗначения) Тогда
		
		Возврат КонтекстТеста[ИмяЗначения];
		
	КонецЕсли;
	
	КонтекстНабора = ЮТКонтекстСлужебный.КонтекстНабора();
	Если (Уровень = Уровни.НаборТестов ИЛИ Уровень = Уровни.Тест)
		И КонтекстНабора <> Неопределено И КонтекстНабора.Свойство(ИмяЗначения) Тогда
			
		Возврат КонтекстНабора[ИмяЗначения];
		
	КонецЕсли;
	
	КонтекстМодуля = ЮТКонтекстСлужебный.КонтекстМодуля();
	Если (Уровень = Уровни.Модуль ИЛИ Уровень = Уровни.Тест ИЛИ Уровень = Уровни.НаборТестов)
		И КонтекстМодуля <> Неопределено И КонтекстМодуля.Свойство(ИмяЗначения) Тогда
			
		Возврат КонтекстМодуля[ИмяЗначения];
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Установить значение.
//  Устанавливает значение в контекст тестов.
//  Установка происходит в соответствии с уровнем исполнения
// Параметры:
//  ИмяЗначения - Строка
//  Значение - Произвольный
Процедура УстановитьЗначение(ИмяЗначения, Значение) Экспорт
	
	Уровень = ЮТКонтекстСлужебный.КонтекстИсполнения().Уровень;
	Уровни = ЮТФабрика.УровниИсполнения();
	
	Контекст = ТекущийКонтекст();
	
	Если Контекст = Неопределено Тогда
		
		Если Уровень = Уровни.Тест Тогда
			ЮТКонтекстСлужебный.УстановитьКонтекстТеста();
		ИначеЕсли Уровень = Уровни.НаборТестов Тогда
			ЮТКонтекстСлужебный.УстановитьКонтекстНабораТестов();
		ИначеЕсли Уровень = Уровни.Модуль Тогда
			ЮТКонтекстСлужебный.УстановитьКонтекстМодуля();
		Иначе
			ВызватьИсключение СтрШаблон("Неизвестный уровень исполнения `%1`", Уровень);
		КонецЕсли;
		
		Контекст = ТекущийКонтекст();
		
	КонецЕсли;
	
	Контекст.Вставить(ИмяЗначения, Значение);
	
КонецПроцедуры

// Текущий контекст исполнения теста
// 
// Возвращаемое значение:
//  Неопределено, Структура, Произвольный -  Текущий контекст
Функция ТекущийКонтекст() Экспорт
	
	Уровень = ЮТКонтекстСлужебный.КонтекстИсполнения().Уровень;
	Уровни = ЮТФабрика.УровниИсполнения();
	
	Если Уровень = Уровни.Тест Тогда
		
		Контекст = ЮТКонтекстСлужебный.КонтекстТеста();
		
	ИначеЕсли Уровень = Уровни.НаборТестов Тогда
		
		Контекст = ЮТКонтекстСлужебный.КонтекстНабора();
		
	ИначеЕсли Уровень = Уровни.Модуль Тогда
		
		Контекст = ЮТКонтекстСлужебный.КонтекстМодуля();
		
	Иначе
		
		Контекст = Неопределено;
		
	КонецЕсли;
	
	Возврат Контекст;
	
КонецФункции

#КонецОбласти
