//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// СформироватьОтчет
//  Формирует отчет о результатах тестирования по заданным параметрам
// Параметры:
//  РезультатВыполнения - Массив из см. ЮТФабрика.ОписаниеИсполняемогоТестовогоМодуля
//  ПараметрыЗапуска - Структура - Параметры запуска, см. ЮТФабрика.ПараметрыЗапуска
//  Обработчик - ОписаниеОповещения
Процедура СформироватьОтчет(РезультатВыполнения, ПараметрыЗапуска, Обработчик) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗапуска.reportPath) Тогда
		ЮТЛогирование.Ошибка("Не указан путь сохранения отчета");
		ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьОбработчик(Обработчик);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормирования = МодульФормирования(ПараметрыЗапуска.reportFormat);
	
	Если ПараметрыФормирования = Неопределено Тогда
		ЮТЛогирование.Ошибка(СтрШаблон("Отчет в формате `%1` не поддерживается", ПараметрыЗапуска.reportFormat));
		ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьОбработчик(Обработчик);
		Возврат;
	КонецЕсли;
	
	МодульОтчета = ПараметрыФормирования.Модуль;
	Формат = ПараметрыФормирования.Формат;
	ПараметрыФормирования = Новый Структура("РезультатВыполнения, ПараметрыЗапуска, Обработчик", РезультатВыполнения, ПараметрыЗапуска, Обработчик);
	ПараметрыФормирования.Вставить("МодульОтчета", МодульОтчета);
	ПараметрыФормирования.Вставить("Формат", Формат);
	
	ОбработчикПолученияИмениФайла = Новый ОписаниеОповещения("ПослеФормированияИмениФайла", ЭтотОбъект, ПараметрыФормирования);
	ПодготовитьИмяФайлаОтчета(ПараметрыФормирования, ОбработчикПолученияИмениФайла);
	
КонецПроцедуры

// Поддерживаемые форматы отчетов.
// 
// Возвращаемое значение:
//  Структура - Поддерживаемые форматы отчетов
//				+ Ключ - Идентификатор формата
//				+ Значение - см. ЮТФабрикаСлужебный.ОписаниеФорматаОтчета
Функция ПоддерживаемыеФорматыОтчетов() Экспорт
	
	Модули = ЮТПодключаемыеМодулиСлужебный.ГенераторыОтчетов();
	Форматы = Новый Структура;
	
	Для Каждого Модуль Из Модули Цикл
		
		Параметры = Модуль.ПараметрыГенерацииОтчета();
		ЮТКоллекции.ДополнитьСтруктуру(Форматы, Параметры.Форматы);
		
	КонецЦикла;
	
	Возврат Форматы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьОтчетВФормате(РезультатВыполнения, ГенераторОтчета, ИмяФайлаОтчета, Формат, Обработчик)
	
	Если Формат.СамостоятельнаяЗаписьОтчета Тогда
		ГенераторОтчета.ЗаписатьОтчет(РезультатВыполнения, ИмяФайлаОтчета, Формат, Обработчик);
		ЮТЛогирование.Информация("Сохранен отчет о тестировании " + ИмяФайлаОтчета);
		ЮТВнешнийЗапускТестовСлужебныйКлиент.ОповеститьОСохраненииОтчета(ИмяФайлаОтчета);
	Иначе
		ДанныеОтчета = ГенераторОтчета.ДанныеОтчета(РезультатВыполнения, Формат);
		
		Если ДанныеОтчета = Неопределено Тогда
			ЮТЛогирование.Ошибка("Не удалось получить данные отчета");
		Иначе
			ДанныеОтчета.Записать(ИмяФайлаОтчета);
			ЮТЛогирование.Информация("Сохранен отчет о тестировании " + ИмяФайлаОтчета);
			ЮТВнешнийЗапускТестовСлужебныйКлиент.ОповеститьОСохраненииОтчета(ИмяФайлаОтчета);
		КонецЕсли;
		
		ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьОбработчик(Обработчик);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьИмяФайлаОтчета(ПараметрыФормирования, Обработчик)
	
	ПараметрыПроверки = Новый Структура("ПараметрыФормирования, Обработчик", ПараметрыФормирования, Обработчик);
	
	ОбработчикПроверки = Новый ОписаниеОповещения("ПослеПроверкиСуществования", ЭтотОбъект, ПараметрыПроверки);
	ЮТФайлы.Существует(ПараметрыФормирования.ПараметрыЗапуска.reportPath, ОбработчикПроверки);
	
КонецПроцедуры

Функция МодульФормирования(Формат)
	
	Модули = ЮТПодключаемыеМодулиСлужебный.ГенераторыОтчетов();
	
	Для Каждого Модуль Из Модули Цикл
		
		Параметры = Модуль.ПараметрыГенерацииОтчета();
		Если Параметры.Форматы.Свойство(Формат) Тогда
			Возврат Новый Структура("Модуль, Формат", Модуль, Параметры.Форматы[Формат]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПослеПроверкиСуществования(Существует, Параметры) Экспорт
	
	ПутьКОтчету = Параметры.ПараметрыФормирования.ПараметрыЗапуска.reportPath;
	Если Существует Тогда
		ОбработчикПроверки = Новый ОписаниеОповещения("ПослеПроверкиКаталога", ЭтотОбъект, Параметры);
		ЮТФайлы.ЭтоКаталог(ПутьКОтчету, ОбработчикПроверки);
		Возврат;
	КонецЕсли;
	
	Формат = Параметры.ПараметрыФормирования.Формат;
	Если Формат.ЗаписьВКаталог Тогда
		НачатьСозданиеКаталога(Новый ОписаниеОповещения("ПослеСозданияКаталогаОтчета", ЭтотОбъект, Параметры), ПутьКОтчету);
	Иначе
		ПослеПроверкиКаталога(Ложь, Параметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеСозданияКаталогаОтчета(ИмяКаталога, Параметры) Экспорт
	
	ПослеПроверкиКаталога(Истина, Параметры);
	
КонецПроцедуры

Процедура ПослеПроверкиКаталога(ЭтоКаталог, Параметры) Экспорт
	
	ПутьКОтчету = Параметры.ПараметрыФормирования.ПараметрыЗапуска.reportPath;
	Формат = Параметры.ПараметрыФормирования.Формат;
	
	Если НЕ Формат.ЗаписьВКаталог И ЭтоКаталог Тогда
		ИмяФайла = ЮТФайлы.ОбъединитьПути(ПутьКОтчету, Формат.ИмяФайлаПоУмолчанию);
	Иначе
		ИмяФайла = ПутьКОтчету;
	КонецЕсли;
	
	ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьОбработчик(Параметры.Обработчик, ИмяФайла);
	
КонецПроцедуры

Процедура ПослеФормированияИмениФайла(ИмяФайлаОтчета, Параметры) Экспорт
	
	СформироватьОтчетВФормате(Параметры.РезультатВыполнения, Параметры.МодульОтчета, ИмяФайлаОтчета, Параметры.Формат, Параметры.Обработчик);
	
КонецПроцедуры

#КонецОбласти
