//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Выполняет вызов метода модуля конфигурации
// 
// Параметры:
//  ИмяМодуля - Строка - Имя модуля
//  ИмяМетода - Строка - Имя метода
//  Параметры - Неопределено - Вызов метода без параметров
//            - Массив из Произвольный - Параметры вызова метода
//                В качестве конструктора параметров можно использовать см. МассивПараметров
Процедура ВызватьМетодМодуля(ИмяМодуля, ИмяМетода, Параметры = Неопределено) Экспорт
	
#Если ВебКлиент Тогда
	ВызватьИсключение ЮТИсключения.МетодНеДоступен("ЮТМетоды.ВызватьМетодМодуля");
#КонецЕсли
	
	ЮТМетодыСлужебный.ВыполнитьМетодКонфигурации(ИмяМодуля, ИмяМетода, Параметры);
	
КонецПроцедуры

// Выполняет вызов метода указанного объекта
// 
// Параметры:
//  Объект - Строка - Объект, метод которого необходимо вызвать
//  ИмяМетода - Строка - Имя метода
//  Параметры - Неопределено - Вызов метода без параметров
//            - Массив из Произвольный - Параметры вызова метода
//                В качестве конструктора параметров можно использовать см. МассивПараметров
Процедура ВызватьМетодОбъекта(Объект, ИмяМетода, Параметры = Неопределено) Экспорт
	
#Если ВебКлиент Тогда
	ВызватьИсключение ЮТИсключения.МетодНеДоступен("ЮТМетоды.ВызватьМетодОбъекта");
#КонецЕсли
	
	ЮТМетодыСлужебный.ВыполнитьМетодОбъекта(Объект, ИмяМетода, Параметры);
	
КонецПроцедуры

// Формирует массив параметров. Применяется при обучении (настройке) мокито.
// Если параметр пропущен, то будет использовать параметр по умолчанию.
// 
// Параметры:
//  Параметр1 - Произвольный
//  Параметр2 - Произвольный
//  Параметр3 - Произвольный
//  Параметр4 - Произвольный
//  Параметр5 - Произвольный
//  Параметр6 - Произвольный
//  Параметр7 - Произвольный
//  Параметр8 - Произвольный
//  Параметр9 - Произвольный
//  Параметр10 - Произвольный
// 
// Возвращаемое значение:
//  Массив из Произвольный - Массив параметров
//@skip-check method-too-many-params
// BSLLS:NumberOfOptionalParams-off
// BSLLS:NumberOfParams-off
// BSLLS:DuplicateStringLiteral-off
Функция МассивПараметров(Параметр1 = "_!%*",
						 Параметр2 = "_!%*",
						 Параметр3 = "_!%*",
						 Параметр4 = "_!%*",
						 Параметр5 = "_!%*",
						 Параметр6 = "_!%*",
						 Параметр7 = "_!%*",
						 Параметр8 = "_!%*",
						 Параметр9 = "_!%*",
						 Параметр10 = "_!%*") Экспорт
	
	Возврат ЮТОбщийСлужебный.ЗначениеВМассивеПоУмолчанию(ПараметрПоУмолчанию(),
														 Параметр1,
														 Параметр2,
														 Параметр3,
														 Параметр4,
														 Параметр5,
														 Параметр6,
														 Параметр7,
														 Параметр8,
														 Параметр9,
														 Параметр10);
	
КонецФункции
// BSLLS:DuplicateStringLiteral-on
// BSLLS:NumberOfParams-on
// BSLLS:NumberOfOptionalParams-on

// Возвращает идентификатор значения входного параметра по умолчанию.
//
// Возвращаемое значение:
//  Строка
//
// Примеры:
//
// ЮТТесты.ДобавитьТест("Тест1")
// 	.СПараметрами(
// 		Мокито.ПараметрПоУмолчанию(),
// 		2); // Будет зарегистрирован один тест с параметрами <значение по умолчанию>, 2
//
Функция ПараметрПоУмолчанию() Экспорт
	
	Возврат "<[ЗначениеВходногоПараметраПоУмолчанию]>";
	
КонецФункции

// Вызывает функцию модуля конфигурации
// И воззвращает результат работы метода
// 
// Параметры:
//  ИмяМодуля - Строка - Имя модуля
//  ИмяМетода - Строка - Имя метода
//  Параметры - Массив из Произвольный - Параметры метода
// 
// Возвращаемое значение:
//  Произвольный - Результат функции
Функция ВызватьФункциюКонфигурации(ИмяМодуля, ИмяМетода, Параметры = Неопределено) Экспорт
	
	Возврат ЮТМетодыСлужебный.ВызватьФункциюКонфигурации(ИмяМодуля, ИмяМетода, Параметры);
	
КонецФункции

#КонецОбласти
