//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

///////////////////////////////////////////////////////////////////
// Расширяет возможности тестирования, 
// позволяет в упрощенной форме получать данны из информационной базы
// как с сервера так и с клиента.
///////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Возвращает значения реквизитов ссылки
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка
//  ИменаРеквизитов - Строка - Имена получаемых реквизитов, разделенные запятой.
//                             Важно, нельзя указывать реквизиты через точку.
// 
// Возвращаемое значение:
//  Структура Из Произвольный - Значения реквизитов ссылки
Функция ЗначенияРеквизитов(Ссылка, ИменаРеквизитов) Экспорт
	
	//@skip-check constructor-function-return-section
	Возврат ЮТЗапросыСлужебныйВызовСервера.ЗначенияРеквизитов(Ссылка, ИменаРеквизитов, Ложь);
	
КонецФункции

// Возвращает значение реквизита ссылки
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка
//  ИмяРеквизита - Строка - Имя получаемого реквизита, можно указать путь к вложенному реквизиту через точку
// 
// Возвращаемое значение:
//  Произвольный - Значение реквизита ссылки
Функция ЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ЮТЗапросыСлужебныйВызовСервера.ЗначенияРеквизитов(Ссылка, ИмяРеквизита, Истина);
	
КонецФункции

// Возвращает первую запись таблицы соответствующую условиям
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы базы
//  Предикат - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//           - Неопределено - Проверит, что таблица не пустая
// Возвращаемое значение:
//  Структура, Неопределено - Содержит все данные записи, включая табличный части
Функция Запись(ИмяТаблицы, Предикат) Экспорт
	
	ОписаниеЗапроса = ЮТЗапросыСлужебныйКлиентСервер.ОписаниеЗапроса(ИмяТаблицы, Предикат, "*");
	//@skip-check constructor-function-return-section
	Возврат ЮТЗапросыСлужебныйВызовСервера.Записи(ОписаниеЗапроса, Истина, Истина);
	
КонецФункции

// Возвращает записи таблицы соответствующую условиям
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы базы
//  Предикат - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//           - Неопределено - Проверит, что таблица не пустая
// Возвращаемое значение:
//  Массив из Структура - Найденные записи, включая табличный части
Функция Записи(ИмяТаблицы, Предикат) Экспорт
	
	ОписаниеЗапроса = ЮТЗапросыСлужебныйКлиентСервер.ОписаниеЗапроса(ИмяТаблицы, Предикат, "*");
	Возврат ЮТЗапросыСлужебныйВызовСервера.Записи(ОписаниеЗапроса, Ложь, Истина);
	
КонецФункции

// Возвращает значения реквизитов первой записи таблицы, соответствующей условиям
// 
// Параметры:
//  ИмяТаблицы - Строка
//  Предикат - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//  ИменаРеквизитов - Строка - Имена получаемых реквизитов
// 
// Возвращаемое значение:
//  Произвольный - Значение реквизита записи
// 
Функция ЗначенияРеквизитовЗаписи(ИмяТаблицы, Предикат, ИменаРеквизитов) Экспорт
	
	ОписаниеЗапроса = ЮТЗапросыСлужебныйКлиентСервер.ОписаниеЗапроса(ИмяТаблицы, Предикат, ИменаРеквизитов);
	Возврат ЮТЗапросыСлужебныйВызовСервера.ЗначенияРеквизитовЗаписи(ОписаниеЗапроса, Ложь);
	
КонецФункции

// Возвращает значение реквизита первой записи таблицы, соответствующей условиям
// 
// Параметры:
//  ИмяТаблицы - Строка
//  Предикат - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//  ИмяРеквизита - Строка - Имя получаемого реквизита
// 
// Возвращаемое значение:
//  Структура Из Произвольный - Значения реквизитов записи
// 
Функция ЗначениеРеквизитаЗаписи(ИмяТаблицы, Предикат, ИмяРеквизита) Экспорт
	
	ОписаниеЗапроса = ЮТЗапросыСлужебныйКлиентСервер.ОписаниеЗапроса(ИмяТаблицы, Предикат, ИмяРеквизита);
	//@skip-check constructor-function-return-section
	Возврат ЮТЗапросыСлужебныйВызовСервера.ЗначенияРеквизитовЗаписи(ОписаниеЗапроса, Истина);
	
КонецФункции

// Вернет признак содержит ли таблица записи удовлетворяющие переданным условиям
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы базы
//  Предикат - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//           - Неопределено - Проверит, что таблица не пустая
// Возвращаемое значение:
//  Булево - Таблица содержит записи
Функция ТаблицаСодержитЗаписи(ИмяТаблицы, Предикат = Неопределено) Экспорт
	
	ОписаниеЗапроса = ЮТЗапросыСлужебныйКлиентСервер.ОписаниеЗапроса(ИмяТаблицы, Предикат);
	Возврат НЕ РезультатПустой(ОписаниеЗапроса);
	
КонецФункции

// Возвращает количество записей таблицы удовлетворяющих переданным условиям
//
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы базы
//  Предикат - Массив из см. ЮТФабрика.ВыражениеПредиката - Набор условий, см. ЮТПредикаты.Получить
//           - см. ЮТФабрика.ВыражениеПредиката
//           - ОбщийМодуль - Модуль настройки предикатов, см. ЮТест.Предикат
//           - Неопределено - Проверит, что таблица не пустая
//
// Возвращаемое значение:
//  Число - Количество записей
//
Функция КоличествоЗаписей(ИмяТаблицы, Предикат = Неопределено) Экспорт
	
	ОписаниеЗапроса = ЮТЗапросыСлужебныйКлиентСервер.ОписаниеЗапроса(ИмяТаблицы, Предикат);
	Возврат ЮТЗапросыСлужебныйВызовСервера.КоличествоЗаписей(ОписаниеЗапроса);
	
КонецФункции

// Возвращает результат выполнения простого запроса.
// 
// Параметры:
//  ОписаниеЗапроса - см. ОписаниеЗапроса
// 
// Возвращаемое значение:
//  - ТаблицаЗначений - Результат запроса для сервера
//  - Массив из Структура - Результат запроса для клиента
Функция РезультатЗапроса(ОписаниеЗапроса) Экспорт
	
#Если Клиент Тогда
	Возврат ЮТЗапросыСлужебныйВызовСервера.РезультатЗапроса(ОписаниеЗапроса, Истина);
#Иначе
	Возврат ЮТЗапросыСлужебныйВызовСервера.РезультатЗапроса(ОписаниеЗапроса, Ложь);
#КонецЕсли
	
КонецФункции

// Определяет, есть ли в результате записи
// 
// Параметры:
//  ОписаниеЗапроса - см. ОписаниеЗапроса
// 
// Возвращаемое значение:
//  Булево - Результат пустой
Функция РезультатПустой(ОписаниеЗапроса) Экспорт
	
	Возврат ЮТЗапросыСлужебныйВызовСервера.РезультатПустой(ОписаниеЗапроса);
	
КонецФункции

// Описание простого запроса
// 
// Возвращаемое значение:
//  Структура - Описание запроса:
// * ИмяТаблицы - Строка - Имя таблицы, из которой нужно получить данные
// * ВыбираемыеПоля - Массив из Строка - Выражения выбираемых полей
// * КоличествоЗаписей - Число, Неопределено - Ограничение количества выбираемых записей
// * Условия - Массив из Строка - Коллекция выражений условий, которые будут объединены через `И`
// * ЗначенияПараметров - Структура - Набор параметров запроса
// * Порядок - Массив из Строка - Поля сортировки
Функция ОписаниеЗапроса() Экспорт
	
	Описание = Новый Структура();
	Описание.Вставить("ИмяТаблицы", "");
	Описание.Вставить("ВыбираемыеПоля", Новый Массив);
	Описание.Вставить("КоличествоЗаписей", Неопределено);
	Описание.Вставить("Условия", Новый Массив());
	Описание.Вставить("Порядок", Новый Массив());
	Описание.Вставить("ЗначенияПараметров", Новый Структура());
	
	//@skip-check constructor-function-return-section
	Возврат Описание;
	
КонецФункции

// Функция получает список движений по указанному документу и регистру. 
// Если документ не делает движений по указанному регистру, функция вызывает исключение. 
// Результатом работы функции является список записей регистра, отсортированных по номеру строки.
// 
// Параметры:
//  Документ - ДокументСсылка
//  ИмяРегистра - Строка - Короткое или полное имя регистра движений
// 
// Возвращаемое значение:
//  - Массив из Структура - Движения документа для клиента
//  - ТаблицаЗначений - Движения документа для сервера
Функция ДвиженияДокумента(Документ, Знач ИмяРегистра) Экспорт
	
	Если СтрНайти(ИмяРегистра, ".") = 0 Тогда
		РегистрыДвижения = ЮТМетаданные.РегистрыДвиженийДокумента(Документ);
		
		Если НЕ РегистрыДвижения.Свойство(ИмяРегистра) Тогда
			ВызватьИсключение "Документ не делает движений по регистру " + ИмяРегистра;
		КонецЕсли;
		
		ИмяРегистра = РегистрыДвижения[ИмяРегистра];
	КонецЕсли;
	
	Предикат = ЮТест.Предикат().Реквизит("Регистратор").Равно(Документ);
	ОписаниеЗапроса = ЮТЗапросыСлужебныйКлиентСервер.ОписаниеЗапроса(ИмяРегистра, Предикат, "*");
	ОписаниеЗапроса.Порядок.Добавить("НомерСтроки");
	
#Если Клиент Тогда
	Возврат ЮТЗапросыСлужебныйВызовСервера.Записи(ОписаниеЗапроса, Ложь, Истина);
#Иначе
	Возврат ЮТЗапросыСлужебныйВызовСервера.Записи(ОписаниеЗапроса, Ложь, Ложь);
#КонецЕсли
	
КонецФункции

#КонецОбласти
