//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Возвращает информацию об окружении
// 
// Возвращаемое значение:
//  см. ЮТФабрика.НовоеОписаниеОкружения
Функция ОписаниеОкружения() Экспорт
	
	//@skip-check constructor-function-return-section
	ЗначениеКонтекста = ЮТКонтекстСлужебный.ЗначениеКонтекста("Окружение");
	Если ЗначениеКонтекста = Неопределено Тогда // TODO Реализовать кеширование при использовании вне тестов
		// Получаем явно окружение.
		ЗначениеКонтекста = ЮТОкружениеСлужебныйКлиентСервер.ОписаниеОкружения();
	КонецЕсли;
	
	Возврат ЗначениеКонтекста;
	
КонецФункции

// Версия платформы.
// 
// Возвращаемое значение:
//  Строка - Версия платформы
Функция ВерсияПлатформы() Экспорт
	
	Возврат ЮТСлужебныйПовторногоИспользования.ВерсияПлатформы();
	
КонецФункции

// Проверяет версию платформы (без учета режима совместимости)
// 
// Параметры:
//  ВерсияДляПроверки - Строка - Версия, с которой необходимо сравнить версию платформы
// 
// Возвращаемое значение:
//  Булево - Версия платформы больше или равна указанной
Функция ВерсияПлатформыБольшеИлиРавна(ВерсияДляПроверки) Экспорт
	
	Возврат ЮТСтроки.СравнитьВерсии(ЮТСлужебныйПовторногоИспользования.ВерсияПлатформы(), ВерсияДляПроверки) >= 0;
	
КонецФункции

// Проверяет версию платформы (без учета режима совместимости)
// 
// Параметры:
//  ВерсияДляПроверки - Строка - Версия, с которой необходимо сравнить версию платформы
// 
// Возвращаемое значение:
//  Булево - Версия платформы меньше указанной
Функция ВерсияПлатформыМеньше(ВерсияДляПроверки) Экспорт
	
	Возврат ЮТСтроки.СравнитьВерсии(ЮТСлужебныйПовторногоИспользования.ВерсияПлатформы(), ВерсияДляПроверки) < 0;
	
КонецФункции

// Используется английский встроенный язык разработки.
// 
// Возвращаемое значение:
//  Булево - Используется английский встроенный язык
Функция ИспользуетсяАнглийскийВстроенныйЯзык() Экспорт
	
	Возврат СтрСравнить(ОписаниеОкружения().ВстроенныйЯзык, "en") = 0;
	
КонецФункции

// Используется русский встроенный язык разработки.
// 
// Возвращаемое значение:
//  Булево - Используется русский встроенный язык
Функция ИспользуетсяРусскийВстроенныйЯзык() Экспорт
	
	Возврат СтрСравнить(ОписаниеОкружения().ВстроенныйЯзык, "ru") = 0;
	
КонецФункции

// Проверяет тип текущей операционной системы
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоWindows() Экспорт
	
	Информация = Новый СистемнаяИнформация();
	Возврат Информация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Информация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
КонецФункции

// Проверяет тип текущей операционной системы
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоLinux() Экспорт
	
	Информация = Новый СистемнаяИнформация();
	Возврат Информация.ТипПлатформы = ТипПлатформы.Linux_x86 Или Информация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

// Проверяет тип текущей операционной системы
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоMac() Экспорт
	
	Информация = Новый СистемнаяИнформация();
	Возврат Информация.ТипПлатформы = ТипПлатформы.MacOS_x86 Или Информация.ТипПлатформы = ТипПлатформы.MacOS_x86_64;
	
КонецФункции

// Возвращает код языка интерфейса.
// 
// Возвращаемое значение:
//  Строка - Локаль интерфейса
Функция ЛокальИнтерфейса() Экспорт
	
#Если ТонкийКлиент Или ВебКлиент Тогда
	Возврат ТекущийЯзык();
#Иначе
	Возврат ТекущийЯзык().КодЯзыка;
#КонецЕсли
	
КонецФункции

// Возвращает код языка платформы.
// 
// Возвращаемое значение:
//  Строка - Локаль платформы
Функция ЛокальПлатформы() Экспорт
	
	Возврат ТекущийЯзыкСистемы();
	
КонецФункции

// Используется английская локаль платформы.
// 
// Возвращаемое значение:
//  Булево - Используется английская локаль платформы
Функция ИспользуетсяАнглийскаяЛокальПлатформы() Экспорт
	
	Возврат ЛокальПлатформы() = "en";
	
КонецФункции

// Используется русская локаль платформы.
// 
// Возвращаемое значение:
//  Булево - Используется русская локаль платформы
Функция ИспользуетсяРусскаяЛокальПлатформы() Экспорт
	
	Возврат ЛокальПлатформы() = "ru";
	
КонецФункции

// Используется файловая база.
// 
// Возвращаемое значение:
//  Булево - Это файловая база
Функция ЭтоФайловаяБаза() Экспорт
	
	Возврат ОписаниеОкружения().ФайловаяБаза;
	
КонецФункции

#КонецОбласти
