//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СкомпилироватьВнешнююОбработку(ТекстМодуляОбъект = "", Знач ТекстМодуляОбычнойФормы = "", Знач ТекстМодуляУправляемойФормы = "") Экспорт
	
	ИдентификаторМодуляОбъекта = "00ab4620-8498-4b18-a4f8-18b53138fcb5.0";
	ИдентификаторФормы = "a10cd1fd-c4ba-437c-9925-b7354192a1ea.0";
	
	Редактор = Обработки.ЮТРедакторОбработки.Создать();
	Редактор.ЗагрузитьШаблон();
	Редактор.УстановитьДанныеФайла(ИдентификаторМодуляОбъекта + "/text", ТекстМодуляОбъект);
	
	ДанныеФормы = Редактор.ТекстФайла(ИдентификаторФормы);
	ДанныеФормы = СтрЗаменить(ДанныеФормы, "MODULE_PLACEHOLDER", ТекстМодуляУправляемойФормы(ТекстМодуляУправляемойФормы));
	Редактор.УстановитьДанныеФайла(ИдентификаторФормы, ДанныеФормы);
	
	Возврат Редактор.СформироватьОбработку();
	
КонецФункции

Функция СкомпилироватьИПодключитьВнешнююОбработку(ТекстМодуляОбъект = "",
												  Знач ТекстМодуляОбычнойФормы = "",
												  Знач ТекстМодуляУправляемойФормы = "") Экспорт
	
	Данные = СкомпилироватьВнешнююОбработку(ТекстМодуляОбъект, ТекстМодуляОбычнойФормы, ТекстМодуляУправляемойФормы);
	
	Возврат ВнешниеОбработки.Подключить(ПоместитьВоВременноеХранилище(Данные));
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстМодуляУправляемойФормы(ОсновнойТекст)
	
	Если НЕ ЗначениеЗаполнено(ОсновнойТекст) Тогда
		Возврат ОсновнойТекст;
	КонецЕсли;
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, """", """""");
	
	МассивСтрок = СтрРазделить(ОсновнойТекст, Символы.ПС);
	Директива = "&НаКлиенте ";
	
	Для Инд = 0 По МассивСтрок.ВГраница() Цикл
		Строка = МассивСтрок[Инд];
		Если СтрНачинаетсяС(СокрЛ(Строка), "Процедура ") Или СтрНачинаетсяС(СокрЛ(Строка), "Функция ") Тогда
			МассивСтрок[Инд] = Директива + Строка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецФункции

#КонецОбласти
