//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ФайлКомпоненты(Знач ИмяМакета, Знач ОперационнаяСистема, Знач Архитектура) Экспорт
	
	Данные = ЮТОбщийСлужебныйВызовСервера.Макет(ИмяМакета);
	ЧтениеАрхива = Новый ЧтениеZipФайла();
	ЧтениеАрхива.Открыть(Данные.ОткрытьПотокДляЧтения());
	
	ИмяФайлаКомпоненты = ИмяФайлаКомпоненты(ЧтениеАрхива, ОперационнаяСистема, Архитектура);
	
	Если ИмяФайлаКомпоненты = Неопределено Тогда
		ВызватьИсключение "Компонента не поддерживает клиентское окружение";
	КонецЕсли;
	
	Данные = ДвоичныеДанныеЭлемента(ЧтениеАрхива, ИмяФайлаКомпоненты);
	
	Возврат Новый ФиксированнаяСтруктура("ИмяФайла, Данные", ИмяФайлаКомпоненты, Данные);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяФайлаКомпоненты(ЧтениеАрхива, ОперационнаяСистема, Архитектура)
	
	Данные = ДвоичныеДанныеЭлемента(ЧтениеАрхива, "MANIFEST.XML");
	
	Если Данные = Неопределено Тогда
		ВызватьИсключение "Архив компоненты не содержит манифеста";
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьПоток(Данные.ОткрытьПотокДляЧтения());
	
	ИмяФайлаКомпоненты = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЭтоПодходящийУзел(ЧтениеXML, ОперационнаяСистема, Архитектура) Тогда
			ИмяФайлаКомпоненты = ЧтениеXML.ЗначениеАтрибута("path");
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат ИмяФайлаКомпоненты;
	
КонецФункции

Функция ЭтоПодходящийУзел(ЧтениеXML, ОперационнаяСистема, Архитектура)
	
	Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента ИЛИ СтрСравнить(ЧтениеXML.Имя, "component") <> 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОперационнаяСистемаУзла = ЧтениеXML.ЗначениеАтрибута("os");
	АрхитектураУзла = ЧтениеXML.ЗначениеАтрибута("arch");
	
	Возврат ОперационнаяСистема = ОперационнаяСистемаУзла И Архитектура = АрхитектураУзла;
	
КонецФункции

Функция ДвоичныеДанныеЭлемента(ЧтениеАрхива, Знач ИмяФайла)
	
	ИмяФайла = НРег(ИмяФайла);
	ЭлементФайла = Неопределено;
	Для Каждого Элемент Из ЧтениеАрхива.Элементы Цикл
		Если НРег(Элемент.ПолноеИмя) = ИмяФайла Тогда
			ЭлементФайла = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЧтениеАрхива.Извлечь(ЭлементФайла, ИмяВременногоФайла, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	
	Данные = Новый ДвоичныеДанные(ЮТФайлы.ОбъединитьПути(ИмяВременногоФайла, ЭлементФайла.Имя));
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти
