//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбработчикиСобытий(Знач ГруппаОбработчиков, Знач Серверные = Истина, Знач Клиентские = Истина) Экспорт
	
	Модули = Новый Массив();
	
	Для Каждого ПодсистемаОбработчикиСобытий Из ПодсистемыПодключаемыхМодулей("ОбработчикиСобытий") Цикл
		
		ЮТКоллекции.ДополнитьМассив(Модули, ЮТМетаданныеСлужебныйВызовСервера.МодулиПодсистемы(ПодсистемаОбработчикиСобытий, Серверные, Клиентские));
		
		ПодсистемаГруппыОбработчиков = ПодсистемаОбработчикиСобытий.Подсистемы.Найти(ГруппаОбработчиков);
		
		Если ПодсистемаГруппыОбработчиков <> Неопределено Тогда
			ЮТКоллекции.ДополнитьМассив(Модули, ЮТМетаданныеСлужебныйВызовСервера.МодулиПодсистемы(ПодсистемаГруппыОбработчиков, Серверные, Клиентские));
		КонецЕсли;
		
	КонецЦикла;
	
	// Изначально планировалось на основе состава подсистем, но он не позволяет задать четкий порядок элементов.
	ПриоритизироватьОбработчикиСобытий(ГруппаОбработчиков, Модули);
	
	Возврат Модули;
	
КонецФункции

Функция ПодключаемыеМодулиПодсистемы(Знач ИмяПодсистемы, Знач Серверные = Истина, Знач Клиентские = Истина) Экспорт
	
	Модули = Новый Массив();
	
	Для Каждого Подсистема Из ПодсистемыПодключаемыхМодулей(ИмяПодсистемы) Цикл
		
		ЮТКоллекции.ДополнитьМассив(Модули, ЮТМетаданныеСлужебныйВызовСервера.МодулиПодсистемы(Подсистема, Серверные, Клиентские));
		
	КонецЦикла;
	
	Возврат Модули;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодсистемыПодключаемыхМодулей(ИмяПодсистемы)
	
	ИменаПодсистем = ЮТМетаданныеСлужебныйПовтИсп.ПодсистемыПодключаемыхМодулей();
	
	Подсистемы = Новый Массив();
	
	Для Каждого ИмяПодсистемыПодключаемыхМодулей Из ИменаПодсистем Цикл
		
		ПодсистемаПодключаемыхМодулей = Метаданные.Подсистемы[ИмяПодсистемыПодключаемыхМодулей];
		
		ВложеннаяПодсистема = ПодсистемаПодключаемыхМодулей.Подсистемы.Найти(ИмяПодсистемы);
		
		Если ВложеннаяПодсистема <> Неопределено Тогда
			Подсистемы.Добавить(ВложеннаяПодсистема);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Подсистемы;
	
КонецФункции

Процедура ПриоритизироватьОбработчикиСобытий(ГруппаОбработчиков, Модули)
	
	Если ГруппаОбработчиков = "ИсполнениеТестов" Тогда
		Порядок = "ЮТЛогированиеСлужебный, ЮТИсполнительСлужебныйКлиент, ЮТКонтекстИсполненияСлужебныйКлиентСервер";
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭлементыПорядка = ЮТКоллекции.ОбратныйПорядок(ЮТСтроки.РазделитьСтроку(Порядок, ","));
	
	Для Каждого Элемент Из ЭлементыПорядка Цикл
		Индекс = Модули.Найти(Элемент);
		Если Индекс <> Неопределено Тогда
			Модули.Удалить(Индекс);
			Модули.Вставить(0, Элемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
