//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СерверноеХранилищеТестов() Экспорт
	
	АдресХранилища = ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяКонтекстаХранилище());
	
	Если АдресХранилища = Неопределено Тогда
		ВызватьИсключение "Не удалось получить адрес серверного хранилища тестов.
						  |Возможно сломана транзакция. ТранзакцияАктивна=" + ТранзакцияАктивна();
	КонецЕсли;
	
	Возврат ПолучитьИзВременногоХранилища(АдресХранилища);
	
КонецФункции

Процедура СохранитьИнформациюОТестовыхСценариях(ТестовыеМодули) Экспорт
	
	Хранилище = Новый Соответствие();
	
	Для Каждого ОсновнойМодуль Из ТестовыеМодули Цикл
		
		Модуль = ЮТКоллекции.СкопироватьСтруктуру(ОсновнойМодуль, Ложь);
		Идентификатор = ЮТИсполнительСлужебныйКлиентСервер.ИдентификаторТестовогоМодуля(Модуль);
		
		Хранилище.Вставить(Идентификатор, Модуль);
		
		Для Каждого Набор Из ОсновнойМодуль.НаборыТестов Цикл
			
			Идентификатор = ЮТИсполнительСлужебныйКлиентСервер.ИдентификаторТестовогоНабора(Модуль, Набор);
			Хранилище.Вставить(Идентификатор, Набор);
			
			Для Каждого Тест Из Набор.Тесты Цикл
				
				Идентификатор = ЮТИсполнительСлужебныйКлиентСервер.ИдентификаторТеста(Модуль, Набор, Тест);
				Хранилище.Вставить(Идентификатор, Тест);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Модуль.НаборыТестов = Новый Массив; // Уже не нужно, поэтому очистим
		
	КонецЦикла;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Хранилище, Новый УникальныйИдентификатор());
	ЮТКонтекстСлужебный.УстановитьЗначениеКонтекста(ИмяКонтекстаХранилище(), АдресХранилища, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяКонтекстаХранилище()
	
	Возврат "ХранилищеТестовыхСценариев";
	
КонецФункции

#КонецОбласти
