//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьЗапись(Знач Менеджер, Знач Данные, Знач ПараметрыЗаписи, Знач ВернутьОбъект) Экспорт
	
	Возврат ЮТТестовыеДанныеСлужебныйСервер.СоздатьЗапись(Менеджер, Данные, ПараметрыЗаписи, ВернутьОбъект);
	
КонецФункции

Процедура ЗаписатьДвиженияРегистратора(Знач Регистратор, Знач Данные, Знач Менеджер, Знач ПараметрыЗаписи) Экспорт
	
	ЮТТестовыеДанныеСлужебныйСервер.ЗаписатьДвиженияРегистратора(Регистратор, Данные, Менеджер, ПараметрыЗаписи);
	
КонецПроцедуры

Функция НовыйОбъект(Знач Менеджер, Знач Данные, Знач ДополнительныеСвойства, Знач УникальныйИдентификаторСсылки) Экспорт
	
	Возврат ЮТТестовыеДанныеСлужебныйСервер.НовыйОбъект(Менеджер, Данные, ДополнительныеСвойства, УникальныйИдентификаторСсылки);
	
КонецФункции

Процедура Удалить(Знач Ссылки, Знач Привилегированно) Экспорт
	
	ЮТТестовыеДанныеСлужебныйСервер.Удалить(Ссылки, Привилегированно);
	
КонецПроцедуры

Функция ФикцияЗначенияБазы(Знач ТипЗначения, Знач РеквизитыЗаполнения) Экспорт
	
	Возврат ЮТТестовыеДанныеСлужебныйСервер.ФикцияЗначенияБазы(ТипЗначения, РеквизитыЗаполнения);
	
КонецФункции

Функция ЗагрузитьИзМакета(Знач Макет,
						  Знач ОписанияТипов,
						  КэшЗначений,
						  Знач ЗаменяемыеЗначения,
						  Знач ПараметрыЗаполнения,
						  Знач ТаблицаЗначений) Экспорт
	
	Возврат ЮТТестовыеДанныеСлужебныйСервер.ЗагрузитьИзМакета(Макет,
															  ОписанияТипов,
															  КэшЗначений,
															  ЗаменяемыеЗначения,
															  ПараметрыЗаполнения,
															  ТаблицаЗначений);
	
КонецФункции

Процедура ЗагрузитьДвиженияИзМакета(Знач Документ,
									Знач ИмяРегистра,
									Знач Макет,
									Знач ОбщиеРеквизиты,
									ПараметрыЗагрузкиМакетов) Экспорт
	
	ЮТТестовыеДанныеСлужебныйСервер.ЗагрузитьДвиженияИзМакета(Документ,
															  ИмяРегистра,
															  Макет,
															  ОбщиеРеквизиты,
															  ПараметрыЗагрузкиМакетов);
	
КонецПроцедуры

Процедура ЗагрузитьИзМакетаВТаблицу(Знач ИмяТаблицы,
									Знач Макет,
									Знач ОбщиеРеквизиты,
									ПараметрыЗагрузкиМакетов) Экспорт
	
	ЮТТестовыеДанныеСлужебныйСервер.ЗагрузитьИзМакетаВТаблицу(ИмяТаблицы,
															  Макет,
															  ОбщиеРеквизиты,
															  ПараметрыЗагрузкиМакетов);
	
КонецПроцедуры

Функция СлучайноеЗначениеПеречисления(Знач Перечисление) Экспорт
	
	Возврат ЮТТестовыеДанныеСлужебныйСервер.СлучайноеЗначениеПеречисления(Перечисление);
	
КонецФункции

Функция СлучайноеПредопределенноеЗначение(Знач Менеджер, Знач Отбор) Экспорт
	
	Возврат ЮТТестовыеДанныеСлужебныйСервер.СлучайноеПредопределенноеЗначение(Менеджер, Отбор);
	
КонецФункции

Процедура УстановитьЗначенияРеквизитов(Знач Ссылка, Знач ЗначенияРеквизитов, Знач ПараметрыЗаписи) Экспорт
	
	ЮТТестовыеДанныеСлужебныйСервер.УстановитьЗначенияРеквизитов(Ссылка, ЗначенияРеквизитов, ПараметрыЗаписи);
	
КонецПроцедуры

Процедура УстановитьФоновуюБлокировку(Знач Блокировка, Знач Длительность) Экспорт
	
	ЮТТестовыеДанныеСлужебныйСервер.УстановитьФоновуюБлокировку(Блокировка, Длительность);
	
КонецПроцедуры

Функция ФикцияЗначений(Знач Реквизиты, Знач РеквизитыЗаполнения) Экспорт
	
	Возврат ЮТТестовыеДанныеСлужебный.ФикцияЗначений(Реквизиты, РеквизитыЗаполнения);
	
КонецФункции

#КонецОбласти
