//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеЗапроса(ИмяТаблицы, ПредикатыУсловия, ВыбираемыеПоля = Неопределено) Экспорт
	
	Описание = ЮТЗапросы.ОписаниеЗапроса();
	Описание.ИмяТаблицы = ИмяТаблицы;
	Если ВыбираемыеПоля = Неопределено Тогда
		Описание.ВыбираемыеПоля.Добавить("1 КАК Проверка");
	Иначе
		ЗаполнитьВыбираемыеПоля(Описание, ВыбираемыеПоля);
	КонецЕсли;
	
	Если ПредикатыУсловия <> Неопределено Тогда
		Описание.Условия = ЮТПредикатыСлужебныйКлиентСервер.НаборПредикатов(ПредикатыУсловия);
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВыбираемыеПоля(ОписаниеЗапроса, Знач ВыбираемыеПоля)
	
	ТипПараметра = ТипЗнч(ВыбираемыеПоля);
	
	Если ТипПараметра = Тип("Строка") Тогда
		ВыбираемыеПоля = ЮТСтроки.РазделитьСтроку(ВыбираемыеПоля, ",");
		ТипПараметра = Тип("Массив");
	КонецЕсли;
	
	Если ТипПараметра = Тип("Массив") Тогда
		
		ОписаниеЗапроса.ВыбираемыеПоля = ВыбираемыеПоля;
		
	ИначеЕсли ТипПараметра = Тип("Структура") Тогда
		
		Для Каждого Поле Из ВыбираемыеПоля Цикл
			Выражение = СтрШаблон("%1 КАК %2", Поле.Значение, Поле.Ключ);
			ОписаниеЗапроса.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение ЮТИсключения.НеподдерживаемыйПараметрМетода("ЮТЗапросыКлиентСервер.ЗаполнитьВыбираемыеПоля", ВыбираемыеПоля);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
