//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция УстановленБезопасныйРежим() Экспорт
	
	Возврат БезопасныйРежим();
	
КонецФункции

Функция Макет(ИмяМакета) Экспорт
	
	ЧастиИмени = СтрРазделить(ИмяМакета, ".");
	
	КоличествоБлоковДляОбщегоМакета = 2;
	КоличествоБлоковМакетаМенеджера = 3;
	
	Если ЧастиИмени.Количество() < КоличествоБлоковДляОбщегоМакета Тогда
		ВызватьИсключение СтрШаблон("Некорректное имя макет, если вы хотите получить данные общего макета необходимо указать `ОбщийМакет.%1`",
									ИмяМакета);
	КонецЕсли;
	
	ИндексОбласти = 0;
	Если СтрСравнить(ЧастиИмени[0], "ОбщийМакет") = 0 Тогда
		Макет = ПолучитьОбщийМакет(ЧастиИмени[1]);
		ИндексОбласти = КоличествоБлоковДляОбщегоМакета;
	ИначеЕсли ЧастиИмени.Количество() >= КоличествоБлоковМакетаМенеджера Тогда
		Менеджер = ЮТОбщий.Менеджер(СтрШаблон("%1.%2", ЧастиИмени[0], ЧастиИмени[1]));
		Макет = Менеджер.ПолучитьМакет(ЧастиИмени[КоличествоБлоковМакетаМенеджера - 1]);
		ИндексОбласти = КоличествоБлоковМакетаМенеджера;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректное имя макета `%1`", ИмяМакета);
	КонецЕсли;
	
	Если ЧастиИмени.Количество() > ИндексОбласти Тогда
		Макет = Макет.ПолучитьОбласть(ЧастиИмени[ИндексОбласти]);
	КонецЕсли;
	
	Возврат Макет;
	
КонецФункции

Функция ИзХранилищаЗначений(Знач ХранилищеЗначений) Экспорт
	
	Возврат ХранилищеЗначений.Получить();
	
КонецФункции

Функция ХешMD5(Строка) Экспорт
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(Строка);
	Возврат НРег(СтрЗаменить(Хеш.ХешСумма, " ", ""));
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
