//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыЗапускаТестирования;

&НаКлиенте
Перем СообщениеДляОбработки;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если БезопасныйРежим() Тогда
		ВызватьИсключение "Отключите безопасный режим. Работа редактора невозможна.";
	КонецЕсли;
	
	Сервер = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка
		Каталог = ПолучитьИмяВременногоФайла();
		ЮТОбщийСлужебный.РаспаковатьМакет("ОбщийМакет.ЮТMonacoEditor", Каталог);
		EditorURL = ЮТФайлы.ОбъединитьПути(Каталог, "index.html");
	Исключение
		ВызватьИсключение "Не удалось инициализировать редактор: " + ОписаниеОшибки();
	КонецПопытки;
	
	Если ПараметрыЗапускаТестирования = Неопределено Тогда
		ПараметрыЗапускаТестирования = ЮТПараметрыЗапускаСлужебный.ПараметрыТестированияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура EditorURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьСообщение", ЭтотОбъект);
	ЮТРеактивныйКлиент.ОбработатьСообщение(ЭтотОбъект, Элементы.EditorURL, ДанныеСобытия, СтандартнаяОбработка, Обработчик);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьСообщение(Сообщение, Контекст) Экспорт
	
	СообщениеДляОбработки = Сообщение;
	ПодключитьОбработчикОжидания("ОбработатьСообщениеАсинх", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщениеАсинх()
	
	Если СообщениеДляОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Сообщение = СообщениеДляОбработки;
	СообщениеДляОбработки = Неопределено;
	
	Если СтрСравнить(Сообщение.ИмяСобытия, "runTest") = 0 Тогда
		ЗапуститьТесты(Сообщение);
	КонецЕсли;
	
КонецПроцедуры

// Запустить тесты.
// 
// Параметры:
//  Сообщение - Структура - Параметры запуска теста:
//               * Значение - Структура:
//               	* method - Строка - Имя запускаемого метода
//               	* module - Строка - Текст модуля
&НаКлиенте
Процедура ЗапуститьТесты(Сообщение)
	
	ПоказатьОповещениеПользователя("Прогон тестов", , "Запушено выполнение тестов", БиблиотекаКартинок.ЮТПодсистема);
	ОписаниеМодуля = ЮТИсполнительСлужебныйКлиент.ОписаниеВременногоМодуля();
	ОписаниеМодуля.ИмяМодуля = "ЗапускТестаИзРедактора";
	ОписаниеМодуля.Текст = Сообщение.Значение.module;
	ОписаниеМодуля.КлиентУправляемое = КлиентУправляемоеПриложение;
	ОписаниеМодуля.КлиентОбычное = КлиентОбычноеПриложение;
	ОписаниеМодуля.Сервер = Сервер;
	
	Обработчик = Новый ОписаниеОповещения("ПослеВыполненияТестирования", ЭтотОбъект, Сообщение);
	
	ИмяМетода = Сообщение.Значение.method;
	Если ЗначениеЗаполнено(ИмяМетода) И СтрСравнить(ИмяМетода, "ИсполняемыеСценарии") <> 0 Тогда
		ИменаМетодов = ЮТКоллекции.ЗначениеВМассиве(ОписаниеМодуля.ИмяМодуля + "." + ИмяМетода);
	Иначе
		ИменаМетодов = Неопределено;
	КонецЕсли;
	
	ЮТИсполнительСлужебныйКлиент.ВыполнитьТестыВременногоМодуля(ПараметрыЗапускаТестирования, ОписаниеМодуля, ИменаМетодов, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияТестирования(Результат, Сообщение) Экспорт
	
	ПоказатьОповещениеПользователя("Прогон тестов", , "Завершено выполнение тестов", БиблиотекаКартинок.ЮТПодсистема);
	Ответ = ЮТВнешнийЗапускТестовСлужебныйКлиент.Отчет(Результат);
	ЮТРеактивныйКлиент.ОтправитьОтвет(Элементы.EditorURL, Сообщение, Ответ);
	
КонецПроцедуры

#КонецОбласти
