//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция АдресСерверногоКонтекста() Экспорт
	
	Возврат ЮТКонтекстСлужебныйВызовСервера.АдресСерверногоКонтекста(Ложь);
	
КонецФункции

Функция МетодМодуляСуществует(ИмяМодуля, ИмяМетода) Экспорт
	
	Возврат ЮТМетодыСлужебный.МетодМодуляСуществует(ИмяМодуля, ИмяМетода, Ложь);
	
КонецФункции

Функция ПараметрыТиповОшибок() Экспорт
	
	Возврат ЮТФабрикаСлужебный.ПараметрыТиповОшибок(Ложь);
	
КонецФункции

Функция ОписаниеТиповЛюбаяСсылка() Экспорт
	
	Возврат ЮТТипыДанныхСлужебный.ОписаниеТиповЛюбаяСсылка(Ложь);
	
КонецФункции

Функция ПодключитьКомпоненту(ИмяМакета, ИмяКомпоненты) Экспорт
	
	Возврат ЮТКомпоненты.ПодключитьКомпоненту(ИмяМакета, ИмяКомпоненты, Ложь);
	
КонецФункции

Функция СоздатьКомпоненту(ОписаниеКомпоненты) Экспорт
	
	Возврат ЮТКомпоненты.СоздатьКомпоненту(ОписаниеКомпоненты, Ложь);
	
КонецФункции
	
Функция ПримитивныеТипы() Экспорт
	
	Типы = Новый Массив();
	Типы.Добавить(Тип("Строка"));
	Типы.Добавить(Тип("Число"));
	Типы.Добавить(Тип("Дата"));
	Типы.Добавить(Тип("Булево"));
	Типы.Добавить(Тип("УникальныйИдентификатор"));
	
	Возврат Новый ФиксированныйМассив(Типы);
	
КонецФункции

Функция МножителиИнтервалов() Экспорт
	
	СекундВМинуте = 60;
	СекундВЧасе = СекундВМинуте * 60;
	СекундВДне = СекундВЧасе * 24;
	СекундВНеделе = СекундВДне * 7;
	
	Множители = Новый Структура;
	Множители.Вставить("секунда", 1);
	Множители.Вставить("секунды", 1);
	Множители.Вставить("секунд", 1);
	Множители.Вставить("минута", СекундВМинуте);
	Множители.Вставить("минуты", СекундВМинуте);
	Множители.Вставить("минут", СекундВМинуте);
	Множители.Вставить("час", СекундВЧасе);
	Множители.Вставить("часа", СекундВЧасе);
	Множители.Вставить("часов", СекундВЧасе);
	Множители.Вставить("день", СекундВДне);
	Множители.Вставить("дня", СекундВДне);
	Множители.Вставить("дней", СекундВДне);
	Множители.Вставить("неделя", СекундВНеделе);
	Множители.Вставить("недели", СекундВНеделе);
	Множители.Вставить("недель", СекундВНеделе);
	
	Возврат Множители;
	
КонецФункции

Функция ВерсияПлатформы() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Возврат СистемнаяИнформация.ВерсияПриложения;
	
КонецФункции

Функция ОбработчикиСобытий(Знач Подсистема, Знач Серверные = Истина, Знач Клиентские = Истина) Экспорт
	
	Возврат ЮТПодключаемыеМодулиСлужебныйВызовСервера.ОбработчикиСобытий(Подсистема, Серверные, Клиентские);
	
КонецФункции

#КонецОбласти
