//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет тесты наборов модуля. Возвращает результат прогона
// Это обертка для прогона на сервере
// 
// Параметры:
//  ИдентификаторыТестовыхНаборов - Массив из Строка - Идентификаторы тестовых наборов, см. ЮТИсполнительСлужебныйСервер.СерверноеХранилищеТестов
//  ИдентификаторТестовогоМодуля - Строка - Идентификатор тестового модуля, см. ЮТИсполнительСлужебныйСервер.СерверноеХранилищеТестов
//  ПродолжениеВыполнения - Булево - Продолжение выполнение тестирования модуля после критической ошибки в нем
//  Ошибка - ИнформацияОбОшибке - Информация о критической ошибке
// 
// Возвращаемое значение:
//  Массив из см. ЮТФабрика.ОписаниеИсполняемогоНабораТестов - Результат прогона наборов тестов
Функция ВыполнитьГруппуНаборовТестов(Знач ИдентификаторыТестовыхНаборов,
									 Знач ИдентификаторТестовогоМодуля,
									 Знач ПродолжениеВыполнения,
									 Знач Ошибка) Экспорт
	
	Хранилище = ЮТИсполнительСлужебныйСервер.СерверноеХранилищеТестов();
	
	ТестовыйМодуль = Хранилище[ИдентификаторТестовогоМодуля];
	Наборы = Новый Массив();
	
	Для Каждого Идентификатор Из ИдентификаторыТестовыхНаборов Цикл
		Наборы.Добавить(Хранилище[Идентификатор]);
	КонецЦикла;
	
	Возврат ЮТИсполнительСлужебныйКлиентСервер.ВыполнитьГруппуНаборовТестов(Наборы, ТестовыйМодуль, ПродолжениеВыполнения, Ошибка);
	
КонецФункции

// Сохранить информацию о тестовых сценариях.
// 
// Параметры:
//  ТестовыеМодули - Массив из см. ЮТФабрика.ОписаниеИсполняемогоТестовогоМодуля
Процедура СохранитьИнформациюОТестовыхСценариях(Знач ТестовыеМодули) Экспорт
	
	ЮТИсполнительСлужебныйСервер.СохранитьИнформациюОТестовыхСценариях(ТестовыеМодули);
	
КонецПроцедуры

Функция СоздатьВнешнююОбработку(Знач ОписаниеМодуля) Экспорт
	
	ТекстМодуляОбъект = ?(ОписаниеМодуля.Сервер, ОписаниеМодуля.Текст, "");
	ТекстМодуляОбычнойФормы = ?(ОписаниеМодуля.КлиентОбычное, ОписаниеМодуля.Текст, "");
	ТекстМодуляУправляемойФормы = ?(ОписаниеМодуля.КлиентУправляемое, ОписаниеМодуля.Текст, "");
	
	Данные = ЮТВнешниеОбработкиСлужебныйСервер.СкомпилироватьВнешнююОбработку(ТекстМодуляОбъект,
																						 ТекстМодуляОбычнойФормы,
																						 ТекстМодуляУправляемойФормы);
	
	Возврат ВнешниеОбработки.Подключить(ПоместитьВоВременноеХранилище(Данные), ОписаниеМодуля.ИмяМодуля, Ложь);
	
КонецФункции

Функция СценарииВнешнейОбработки(Знач ИмяОбработки, Знач ОписаниеМодуля) Экспорт
	
	Возврат ЮТИсполнительСлужебныйКлиентСервер.СценарииВнешнейОбработки(ИмяОбработки, ОписаниеМодуля);
	
КонецФункции

#КонецОбласти
