//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьКонтекст(Знач ПараметрыЗапуска) Экспорт
	
	Контекст = ЮТКонтекстСлужебный.ОписаниеКонтекста(ПараметрыЗапуска);
	АдресХранилища = ПоместитьВоВременноеХранилище(Контекст, Новый УникальныйИдентификатор());
	ХранилищеОбщихНастроек.Сохранить(КлючНастроекКонтекста(), "АдресХранилища", АдресХранилища);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Функция ДанныеКонтекста() Экспорт
	
	Адрес = АдресСерверногоКонтекста();
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		
		Возврат ПолучитьИзВременногоХранилища(АдресСерверногоКонтекста());
		
	КонецЕсли;
	
КонецФункции

// УстановитьЗначениеКонтекста
// Устанавливает значение вложенного контекста, вложенного реквизита контекста
// 
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита/вложенного контекста
//  Значение - Произвольный - Новое значение реквизита/вложенного контекста
Процедура УстановитьЗначениеКонтекста(Знач ИмяРеквизита, Знач Значение) Экспорт
	
	ЮТКонтекстСлужебный.УстановитьЗначениеКонтекста(ИмяРеквизита, Значение);
	
КонецПроцедуры

// УстановитьЗначениеКонтекста
// Устанавливает значение вложенного контекста, вложенного реквизита контекста
// 
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита/вложенного контекста
//  Значения - Структура, Соответствие - Новое значение реквизита/вложенного контекста
Процедура ВставитьЗначениеКонтекста(Знач ИмяРеквизита, Знач Значения) Экспорт
	
	ЮТКонтекстСлужебный.ВставитьЗначениеКонтекста(ИмяРеквизита, Значения, Ложь);
	
КонецПроцедуры

Функция ЗначениеКонтекста(Знач ИмяРеквизита) Экспорт
	
	Возврат ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяРеквизита);
	
КонецФункции

Функция КлючНастроекКонтекста() Экспорт
	
	Возврат СтрШаблон("ЮТ%1.Контекста", НомерСеансаИнформационнойБазы());
	
КонецФункции

Функция АдресСерверногоКонтекста(Кэшировать = Истина) Экспорт
	
	Если Кэшировать Тогда
		
		Возврат ЮТСлужебныйПовторногоИспользования.АдресСерверногоКонтекста();
		
	Иначе
		
		Возврат ХранилищеОбщихНастроек.Загрузить(КлючНастроекКонтекста(), "АдресХранилища");
		
	КонецЕсли;
	
КонецФункции

Процедура УдалитьКонтекст() Экспорт
	
	Адрес = АдресСерверногоКонтекста();
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		УдалитьИзВременногоХранилища(Адрес);
		УстановитьПривилегированныйРежим(Истина);
		ХранилищеОбщихНастроек.Удалить(КлючНастроекКонтекста(), "АдресХранилища", Неопределено);
		УстановитьПривилегированныйРежим(Ложь);
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
