//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ТаблицыРавны(ПроверяемоеЗначение, ОжидаемоеЗначение, ПараметрыСравнения) Экспорт
	
	Различия = РазличияТаблиц(ПроверяемоеЗначение, ОжидаемоеЗначение, ПараметрыСравнения);
	Возврат НЕ ЗначениеЗаполнено(Различия);
	
КонецФункции

Функция РазличияТаблиц(ПроверяемоеЗначение, ОжидаемоеЗначение, ПараметрыСравнения) Экспорт
	
	Различия = Новый Массив;
	
	Если ПроверяемоеЗначение.Количество() = 0 И ОжидаемоеЗначение.Количество() = 0 Тогда
		// Нечего сравнивать
		Возврат Различия;
	КонецЕсли;
	
	Если ПроверяемоеЗначение.Количество() <> ОжидаемоеЗначение.Количество() Тогда
		Сообщение = СтрШаблон("Разное количество строк. Ожидали `%1`, а получили `%2`",
							  ОжидаемоеЗначение.Количество(),
							  ПроверяемоеЗначение.Количество());
		Различия.Добавить(Сообщение);
		Возврат Различия;
	КонецЕсли;
	
	Если ПроверяемоеЗначение.Колонки.Количество() <> ОжидаемоеЗначение.Колонки.Количество() Тогда
		Сообщение = СтрШаблон("Разное количество колонок. Ожидали `%1`, а получили `%2`",
							  ОжидаемоеЗначение.Колонки.Количество(),
							  ПроверяемоеЗначение.Колонки.Количество());
		Различия.Добавить(Сообщение);
		Возврат Различия;
	КонецЕсли;
	
	Для Каждого Колонка Из ОжидаемоеЗначение.Колонки Цикл
		
		Если ПроверяемоеЗначение.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			Сообщение = СтрШаблон("Проверяемая таблица не содержит колонку '%1'", Колонка.Имя);
			Различия.Добавить(Сообщение);
			Продолжить;
		КонецЕсли;
		
		Индекс = ПроверяемоеЗначение.Количество() - 1;
		
		Пока Индекс >= 0 Цикл
			
			ЗначенияРавны = ЮТСравнениеСлужебныйКлиентСервер.ЗначенияРавны(ПроверяемоеЗначение[Индекс][Колонка.Имя],
																		   ОжидаемоеЗначение[Индекс][Колонка.Имя],
																		   ПараметрыСравнения);
			Если НЕ ЗначенияРавны Тогда
				Сообщение = СтрШаблон("Строка № %1; колонка '%2'; ожидали %3, а получили %4",
									  Индекс + 1,
									  Колонка.Имя,
									  ЮТСообщенияСлужебный.ПредставлениеЗначения(ОжидаемоеЗначение[Индекс][Колонка.Имя]),
									  ЮТСообщенияСлужебный.ПредставлениеЗначения(ПроверяемоеЗначение[Индекс][Колонка.Имя]));
				Различия.Добавить(Сообщение);
			КонецЕсли;
			
			Индекс = Индекс - 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Различия;
	
КонецФункции

Функция РазличияТабличныхДокументов(ПроверяемыйТабличныйДокумент, ОжидаемыйТабличныйДокумент, ПараметрыСравнения) Экспорт
	
	ПроверяемоеЗначение = ПолучитьТаблицуЗначенийИзТабличногоДокумента(ПроверяемыйТабличныйДокумент);
	ОжидаемоеЗначение = ПолучитьТаблицуЗначенийИзТабличногоДокумента(ОжидаемыйТабличныйДокумент);
	
	Возврат РазличияТаблиц(ПроверяемоеЗначение, ОжидаемоеЗначение, ПараметрыСравнения);
	
КонецФункции

Функция ТабличныеДокументыРавны(ПроверяемыйТабличныйДокумент, ОжидаемыйТабличныйДокумент, ПараметрыСравнения) Экспорт
	
	Различия = РазличияТабличныхДокументов(ПроверяемыйТабличныйДокумент, ОжидаемыйТабличныйДокумент, ПараметрыСравнения);
	Возврат НЕ ЗначениеЗаполнено(Различия);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуЗначенийИзТабличногоДокумента(ТабличныйДокумент, УчитыватьТолькоВидимыеКолонки = Ложь, УчитыватьТолькоВидимыеСтроки = Ложь)
	// https://github.com/vanessa-opensource/add 
	// перенесен из Functest
	
	ЮТПроверкиСлужебный.ПроверитьТипПараметра(ТабличныйДокумент,
											  Тип("ТабличныйДокумент"),
											  "ЮТСравнениеСлужебныйСервер.ПолучитьТаблицуЗначенийИзТабличногоДокумента",
											  "ТабличныйДокумент");
	
	Если УчитыватьТолькоВидимыеКолонки И УчитыватьТолькоВидимыеСтроки Тогда
		ЮТТестовыеДанныеСлужебныйСервер.ТаблицаИзТабличногоДокумента(ТабличныйДокумент);
	КонецЕсли;
	
	НоваяТаблицаЗначений = Новый ТаблицаЗначений;
	
	УчитываемыеКолонки = УчитываемыеКолонки(ТабличныйДокумент, НоваяТаблицаЗначений, УчитыватьТолькоВидимыеКолонки);
	
	ГраницаКолонок = УчитываемыеКолонки.ВГраница();
	НомерПоследнейСтроки = ТабличныйДокумент.ВысотаТаблицы;
	
	Для НомерСтроки = 1 По НомерПоследнейСтроки Цикл
		
		УчитыватьСтроку = УчитыватьТолькоВидимыеСтроки И Не ТабличныйДокумент.Область(НомерСтроки, , НомерСтроки).Видимость;
		Если УчитыватьСтроку Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НоваяТаблицаЗначений.Добавить();
		
		Для Индекс = 0 По ГраницаКолонок Цикл
			Область = ТабличныйДокумент.Область(НомерСтроки, УчитываемыеКолонки[Индекс]);
			НоваяСтрока[Индекс] = Область.Текст;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НоваяТаблицаЗначений;
	
КонецФункции

Функция УчитываемыеКолонки(ТабличныйДокумент, ТаблицаЗначений, УчитыватьТолькоВидимыеКолонки)
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	НомерПоследнейКолонки = ТабличныйДокумент.ШиринаТаблицы;
	Колонки = ТаблицаЗначений.Колонки;
	
	// При определении видимости не учитывается наличие нескольких форматов строк, сейчас видимость колонки определяется по формату первой строки
	УчитываемыеКолонки = Новый Массив;
	Для НомерКолонки = 1 По НомерПоследнейКолонки Цикл
		
		ОбластьКолонки = ТабличныйДокумент.Область(1, НомерКолонки);
		УчитыватьКолонку = Не УчитыватьТолькоВидимыеКолонки Или ОбластьКолонки.Видимость;
		
		Если УчитыватьКолонку Тогда
			УчитываемыеКолонки.Добавить(НомерКолонки);
			ИмяКолонки = "К" + Формат(Колонки.Количество() + 1, "ЧН=; ЧГ=0");
			Колонки.Добавить(ИмяКолонки, ТипСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат УчитываемыеКолонки;
	
КонецФункции

#КонецОбласти
