//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Уровни критичности Allure
// 
// Возвращаемое значение:
//  Структура - Уровни серьезности:
// * Тривиальный - Строка
// * Незначительный - Строка
// * Нормальный - Строка
// * Критический - Строка
// * Блокер - Строка
// * Trivial - Строка
// * Minor - Строка
// * Normal - Строка
// * Critical - Строка
// * Blocker - Строка
Функция УровниСерьезности() Экспорт
	
	Серьезность = Новый Структура;
	Серьезность.Вставить("Тривиальный", "trivial");
	Серьезность.Вставить("Незначительный", "minor");
	Серьезность.Вставить("Нормальный", "normal");
	Серьезность.Вставить("Критический", "critical");
	Серьезность.Вставить("Блокер", "blocker");
	
	Серьезность.Вставить("Trivial", "trivial");
	Серьезность.Вставить("Minor", "minor");
	Серьезность.Вставить("Normal", "normal");
	Серьезность.Вставить("Critical", "critical");
	Серьезность.Вставить("Blocker", "blocker");
	
	Возврат Серьезность;
	
КонецФункции

// Устанавливает идентификатор тест-кейса
// 
// Параметры:
//  Значение - Строка - Идентификатор тест-кейса
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Идентификатор(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Идентификатор, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает текстовое описание теста
// 
// Параметры:
//  Значение - Строка - Текстовое описание теста
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Описание(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Описание, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает HTML-описание теста
// 
// Параметры:
//  Значение - Строка - HTML-описание теста
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция ОписаниеHTML(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().ОписаниеHTML, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает уровень критичности теста
// 
// Параметры:
//  Значение - Строка - Уровень критичности теста (см. УровниСерьезности)
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Серьезность(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Серьезность, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает владельца теста
// 
// Параметры:
//  Значение - Строка - Имя владельца теста
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Владелец(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Владелец, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает эпик теста
// 
// Параметры:
//  Значение - Строка - Название эпика
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Эпик(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Эпик, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает функциональность теста
// 
// Параметры:
//  Значение - Строка - Название функциональности
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Функциональность(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Функциональность, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает историю теста
// 
// Параметры:
//  Значение - Строка - Название истории
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция История(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().История, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает родительский набор тестов
// 
// Параметры:
//  Значение - Строка - Название родительского набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция РодительскийНабор(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().РодительскийНабор, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает набор тестов
// 
// Параметры:
//  Значение - Строка - Название набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Набор(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Набор, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает подчиненный набор тестов
// 
// Параметры:
//  Значение - Строка - Название подчиненного набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция ПодчиненныйНабор(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().ПодчиненныйНабор, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает произвольное свойство (label)
// 
// Параметры:
//  Ключ - Строка - Имя свойства
//  Значение - Строка - Название подчиненного набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Свойство(Ключ, Значение) Экспорт
	
	УстановитьСвойство(Ключ, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает пакет тестов
// 
// Параметры:
//  Значение - Строка - Название пакета
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Пакет(Значение) Экспорт
	
	УстановитьСвойство(ЮТФабрикаСлужебный.СвойстваAllure().Пакет, Значение);
	Возврат ЮТАлюр;
	
КонецФункции

// Устанавливает идентификатор тест-кейса
// 
// Параметры:
//  Значение - Строка - Идентификатор тест-кейса
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция TestCaseId(Значение) Экспорт
	
	Возврат Идентификатор(Значение);
	
КонецФункции

// Устанавливает текстовое описание теста
// 
// Параметры:
//  Значение - Строка - Текстовое описание теста
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Description(Значение) Экспорт
	
	Возврат Описание(Значение);
	
КонецФункции

// Устанавливает HTML-описание теста
// 
// Параметры:
//  Значение - Строка - HTML-описание теста
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция DescriptionHtml(Значение) Экспорт
	
	Возврат ОписаниеHTML(Значение);
	
КонецФункции

// Устанавливает уровень критичности теста
// 
// Параметры:
//  Значение - Строка - Уровень критичности теста (см. УровниСерьезности)
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Severity(Значение) Экспорт
	
	Возврат Серьезность(Значение);
	
КонецФункции

// Устанавливает эпик теста
// 
// Параметры:
//  Значение - Строка - Название эпика
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Epic(Значение) Экспорт
	
	Возврат Эпик(Значение);
	
КонецФункции

// Устанавливает функциональность теста
// 
// Параметры:
//  Значение - Строка - Название функциональности
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Feature(Значение) Экспорт
	
	Возврат Функциональность(Значение);
	
КонецФункции

// Устанавливает историю теста
// 
// Параметры:
//  Значение - Строка - Название истории
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Story(Значение) Экспорт
	
	Возврат История(Значение);
	
КонецФункции

// Устанавливает родительский набор тестов
// 
// Параметры:
//  Значение - Строка - Название родительского набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция ParentSuite(Значение) Экспорт
	
	Возврат РодительскийНабор(Значение);
	
КонецФункции

// Устанавливает набор тестов
// 
// Параметры:
//  Значение - Строка - Название набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Suite(Значение) Экспорт
	
	Возврат Набор(Значение);
	
КонецФункции

// Устанавливает подчиненный набор тестов
// 
// Параметры:
//  Значение - Строка - Название подчиненного набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция SubSuite(Значение) Экспорт
	
	Возврат ПодчиненныйНабор(Значение);
	
КонецФункции

// Устанавливает пакет тестов
// 
// Параметры:
//  Значение - Строка - Название пакета
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Package(Значение) Экспорт
	
	Возврат Пакет(Значение);
	
КонецФункции

// Устанавливает владельца теста
// 
// Параметры:
//  Значение - Строка - Имя владельца теста
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Owner(Значение) Экспорт
	
	Возврат Владелец(Значение);
	
КонецФункции

// Устанавливает произвольное свойство (label)
// 
// Параметры:
//  Ключ - Строка - Имя свойства
//  Значение - Строка - Название подчиненного набора
// 
// Возвращаемое значение:
//  CommonModule.ЮТАлюр - Модуль настройки параметров Allure
Функция Label(Ключ, Значение) Экспорт
	
	Возврат Свойство(Ключ, Значение);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСвойство(Ключ, Значение)
	
	Если ЮТКонтекстСлужебный.ЭтоЭтапРегистрацииТестов() Тогда
		ТекущийЭлемент = ЮТТестыСлужебный.ТекущийЭлемент();
	ИначеЕсли ЮТКонтекстСлужебный.ЭтоЭтапТестовогоПрогона() Тогда
		ТекущийЭлемент = ЮТКонтекстСлужебный.КонтекстИсполненияТекущегоУровня();
	Иначе
		ВызватьИсключение "Настройка параметров Allure доступна только при регистрации или исполнении теста";
	КонецЕсли;
	
	Если НЕ ТекущийЭлемент.Свойство("СвойстваAllure") Тогда
		ТекущийЭлемент.Вставить("СвойстваAllure", Новый Соответствие());
	КонецЕсли;
	
	ТекущийЭлемент.СвойстваAllure.Вставить(Ключ, Значение);
	
КонецПроцедуры

#КонецОбласти
