//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

// BSLLS:ExportVariables-off
Перем ЮТДанныеКонтекста Экспорт; // Хранит данные клиентского контекста тестирования, см. ЮТКонтекстСлужебный.
Перем ЮТПараметрыПодключенияКВнешнемуСервису Экспорт; // Хранит данные для подключения к внешнему rpc серверу, 
                                                      // см. ЮТВнешнийЗапускТестовСлужебныйКлиент.ПодключитсяКСерверу
Перем ЮТТекущееСостояниеИсполненияТестов Экспорт; // Хранит текущее состояние исполнителя тестов, 
                                                  // используется для обработки/восстановления после критических ошибок.
// BSLLS:ExportVariables-on

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// Обработчики событий модуля
///////////////////////////////////////////////////////////////////////////////// 
#Область ОбработчикиСобытий

/////////////////////////////////////////////////////////////////////////////////
// ОТКРЫТИЕ ПРИЛОЖЕНИЯ
///////////////////////////////////////////////////////////////////////////////// 

// Используется для перехвата управления расширением после отработки запуска приложения
//@skip-check not-allowed-pragma
&После("ПриНачалеРаботыСистемы")
Процедура ЮТПриНачалеРаботыСистемы()
	
	ЮТАсинхроннаяОбработкаСлужебныйКлиент.ОтложенныйВызов("ЮТВыполнитьМодульноеТестирование");
	
КонецПроцедуры

&After("OnStart")
Procedure ЮТOnStart()
	
	ЮТПриНачалеРаботыСистемы();
	
EndProcedure

&После("ОбработкаОтображенияОшибки")
Процедура ЮТОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	
	ЮТИсполнительСлужебныйКлиент.ОбработкаГлобальнойОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка);
	
КонецПроцедуры

&After("ErrorDisplayProcessing")
Процедура ЮТErrorDisplayProcessing(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	
	ЮТОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
