//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Возвращает случайный номер банковского счета, по умолчанию
// Подробности алгоритма можно прочитать по ссылке
// http://keysystems.ru/files/fo/arm_budjet/show_docum/BKS/onlinehelphtm/ro_kr_algor_klyuch_rs.htm
// Параметры:
//  БИК - Строка - БИК банка
//  КодВалюты - Строка - Код валюты
//  ЮрЛицо - Булево - Генерация счета юр. лица, иначе физ. лица
//
// Возвращаемое значение:
//  Строка - Номер счета
Функция НомерСчета(БИК, КодВалюты = "810", ЮрЛицо = Истина) Экспорт

	Если СтрДлина(КодВалюты) <> 3 Тогда
		ВызватьИсключение ЮТИсключения.НекорректныеПараметрыМетода("НомерСчета", "Длина кода валюты должна быть равна 3");
	КонецЕсли;
	
	БалансовыйСчет = ?(ЮрЛицо, "40702", "40802");
	НомерСчетаВБанке = ЮТТестовыеДанные.СлучайнаяСтрока(11, , "0123456789");
	
	ЧислоДляРасчетаКонтрольнойСуммы = Прав(БИК, 3) + БалансовыйСчет + КодВалюты + "0" + НомерСчетаВБанке;
	Весы = ВесовыеКоэффициентаДляРасчетаКонтрольнойСуммыСчета();
	
	КонтрольнаяСумма = 0;
	Для Индекс = 0 По 22 Цикл
		КонтрольнаяСумма =
			КонтрольнаяСумма
			+ Число(Сред(ЧислоДляРасчетаКонтрольнойСуммы, Индекс + 1, 1)) * Число(Весы.Получить(Индекс))
		;
	КонецЦикла;
	
	КонтрольноеЧисло = ((КонтрольнаяСумма % 10) * 3) % 10;
	
	Возврат СтрШаблон(
		"%1%2%3%4",
		БалансовыйСчет,
		КодВалюты,
		КонтрольноеЧисло,
		НомерСчетаВБанке
	);
	
КонецФункции

// Формирует случайный валидный БИК банка
//
// Возвращаемое значение:
//  Строка - БИК
Функция БИК() Экспорт
	Возврат	СтрШаблон(
		"%1%2%3%4",
		"04", // код страны
		ЮТТестовыеДанные.СлучайнаяСтрока(2, , "0123456789"), // ОКАТО код территории
		ЮТТестовыеДанные.СлучайнаяСтрока(2, , "0123456789"), // код подразделение расчетной сети ЦБ
		Формат(ЮТТестовыеДанные.СлучайноеЧисло(50, 999), "ЧЦ=3; ЧВН=;") // номер кредитной организации
	);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВесовыеКоэффициентаДляРасчетаКонтрольнойСуммыСчета()
	Возврат СтрРазделить("7,1,3,7,1,3,7,1,3,7,1,3,7,1,3,7,1,3,7,1,3,7,1", ",");
КонецФункции

#КонецОбласти
