//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеЗависимости(ОписаниеЗависимости) Экспорт
	
	КлючЗависимости = КлючЗависимости(ОписаниеЗависимости);
	
	Результаты = ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяКонтекстаДанныеЗависимостей());
	ДанныеЗависимости = Результаты[КлючЗависимости];
	
	Если ДанныеЗависимости <> Неопределено Тогда
		Возврат ДанныеЗависимости;
	КонецЕсли;
	
	РезультатРазрешения = РезультатРазрешенияЗависимости(КлючЗависимости);
	ПредставлениеЗависимости = ПредставлениеЗависимости(ОписаниеЗависимости);
	
	Если РезультатРазрешения = Неопределено Или НЕ РезультатРазрешения.Успешно Тогда
		ВызватьИсключение СтрШаблон("Не указана или не разрешена зависимость `%1`", ПредставлениеЗависимости);
	КонецЕсли;
	
#Если Сервер Тогда
	Если НЕ РезультатРазрешения.ДоступностьНаСервере Тогда
		ВызватьИсключение СтрШаблон("Зависимость `%1` недоступна на сервере", ПредставлениеЗависимости);
	КонецЕсли;
#Иначе
	Если НЕ РезультатРазрешения.ДоступностьНаКлиенте Тогда
		ВызватьИсключение СтрШаблон("Зависимость `%1` недоступна на клиенте", ПредставлениеЗависимости);
	КонецЕсли;
#КонецЕсли
	
	Возврат ДанныеЗависимости;
	
КонецФункции

Функция ДобавитьЗависимостьПриРегистрации(ОписаниеЗависимости) Экспорт
	
	Если ЮТКонтекстСлужебный.ТекущийЭтапПрогона() <> ЮТФабрика.ЭтапыПрогона().ЗагрузкаТестов Тогда
		Возврат ОписаниеЗависимости;
	Иначе
		ЮТТестыСлужебный.ДобавитьЗависимость(ОписаниеЗависимости);
		Возврат ЮТТесты;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючЗависимости(ОписаниеЗависимости) Экспорт
	
	Идентификатор = ВРег(ОписаниеЗависимости.Идентификатор);
	
	Если ЗначениеЗаполнено(ОписаниеЗависимости.Параметры) Тогда
		ДанныеКлюча = Новый Структура("Идентификатор, Параметры", Идентификатор, ОписаниеЗависимости.Параметры);
		Возврат ЮТОбщий.СтрокаJSON(ДанныеКлюча, , Истина);
	Иначе
		Возврат Идентификатор;
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеЗависимости(ОписаниеЗависимости) Экспорт
	
	Если ЗначениеЗаполнено(ОписаниеЗависимости.Параметры) Тогда
		Возврат ОписаниеЗависимости.Идентификатор + ЮТКоллекции.ПредставлениеМассива(ОписаниеЗависимости.Параметры);
	Иначе
		Возврат ОписаниеЗависимости.Идентификатор;
	КонецЕсли;
	
КонецФункции

Функция УникальнаяЗависимость(Зависимости, ОписаниеЗависимости) Экспорт
	
	КлючЗависимости = КлючЗависимости(ОписаниеЗависимости);
	
	УникальнаяЗависимость = Зависимости[КлючЗависимости];
	
	Если УникальнаяЗависимость <> Неопределено Тогда
		Возврат УникальнаяЗависимость;
	КонецЕсли;
	
	Копия = ЮТКоллекции.СкопироватьСтруктуру(ОписаниеЗависимости);
	Копия.Параметры = Новый ФиксированныйМассив(ОписаниеЗависимости.Параметры);
	Копия.Ключ = КлючЗависимости;
	
	УникальнаяЗависимость = Новый ФиксированнаяСтруктура(Копия);
	
	Зависимости.Вставить(КлючЗависимости, УникальнаяЗависимость);
	
	Возврат УникальнаяЗависимость;
	
КонецФункции

Функция РезультатРазрешенияЗависимости(КлючЗависимости)
	
	ДанныеКонтекста = КонтекстРазрешенныеЗависимости();
	Возврат ДанныеКонтекста[КлючЗависимости];
	
КонецФункции

#Область Контексты

// Обработчик события "ИнициализацияКонтекста"
// 
// Параметры:
//  ДанныеКонтекста - Структура
Процедура ИнициализацияКонтекста(ДанныеКонтекста) Экспорт
	
	ДанныеКонтекста.Вставить(ИмяКонтекстаДанныеЗависимостей(), Новый Соответствие());
	ДанныеКонтекста.Вставить(ИмяКонтекстаРазрешенныеЗависимости(), Новый Соответствие());
	
КонецПроцедуры

Функция КонтекстРазрешенныеЗависимости() Экспорт
	
	Возврат ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяКонтекстаРазрешенныеЗависимости());
	
КонецФункции

Функция ИмяКонтекстаРазрешенныеЗависимости() Экспорт
	
	Возврат "КонтекстРазрешенныеЗависимости";
	
КонецФункции

Функция ИмяКонтекстаДанныеЗависимостей() Экспорт
	
	Возврат "КонтекстДанныеЗависимостей";
	
КонецФункции

#КонецОбласти

#КонецОбласти
