//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Указывает зависимость теста (набора или модуля) от файлов проекта.
// Гарантирует доступность файлов как на клиенте, так и на сервере.
// 
// Параметры:
//  ПутьКФайлам - Строка - Относительный путь к файлу проекта (относительно настройки projectPath)
// 
// Возвращаемое значение:
//  CommonModule.ЮТТесты - Файлы проекта
Функция ФайлыПроекта(ПутьКФайлам) Экспорт
	
	ОписаниеЗависимости = ЮТФабрика.НовоеОписаниеЗависимости();
	ОписаниеЗависимости.Идентификатор = "ФайлыПроекта";
	ОписаниеЗависимости.МетодРеализации = "ЮТРазрешениеЗависимостейСлужебныйКлиент.ФайлыПроекта";
	ОписаниеЗависимости.Параметры.Добавить(ПутьКФайлам);
	ОписаниеЗависимости.Асинхронный = Истина;
	
	Возврат ЮТЗависимостиСлужебный.ДобавитьЗависимостьПриРегистрации(ОписаниеЗависимости);
	
КонецФункции

// Указывает зависимость теста (набора или модуля) от фабрики XDTO, создаваемой на основании файлов.
// Создает и кэширует фабрику, предоставляя к доступ из любого серверного теста
// 
// Параметры:
//  ПутьКФайлам - Строка - Относительный путь к файлу проекта (относительно настройки projectPath)
// 
// Возвращаемое значение:
//  CommonModule.ЮТТесты - Файлы проекта
Функция ФабрикаXDTO(ПутьКФайлам) Экспорт
	
	ФайлыПроекта(ПутьКФайлам);
	
	ОписаниеЗависимости = ЮТФабрика.НовоеОписаниеЗависимости();
	ОписаниеЗависимости.Идентификатор = "ФабрикаXDTO";
	ОписаниеЗависимости.МетодРеализации = "ЮТРазрешениеЗависимостейСлужебныйВызовСервера.ФабрикаXDTO";
	ОписаниеЗависимости.Параметры.Добавить(ПутьКФайлам);
	ОписаниеЗависимости.ОбработкаНаСервере = Истина;
	ОписаниеЗависимости.ДоступностьНаКлиенте = Ложь;
	
	Возврат ЮТЗависимостиСлужебный.ДобавитьЗависимостьПриРегистрации(ОписаниеЗависимости);
	
КонецФункции

#КонецОбласти
