//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Проверить тип параметра.
// 
// Параметры:
//  Значение - Произвольный
//  ОжидаемыйТип - Тип, ОписаниеТипов - Ожидаемый тип или описание типа
//               - Строка - Имена типов разделенные запятой
//  ИмяМетода - Строка
//  ИмяПараметра - Строка
//  ЕслиУстановлен - Булево - Выполнять проверку только если значение не неопределено
Процедура ПроверитьТипПараметра(Значение, ОжидаемыйТип, ИмяМетода, ИмяПараметра, ЕслиУстановлен = Ложь) Экспорт
	
	Если ЕслиУстановлен И Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Соответствует = ТипЗначенияСоответствует(Значение, ОжидаемыйТип);
	
	Если НЕ Соответствует Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип параметра `%1` метода `%2`. Метод принимает `%3`, а получили `%4` (%5)",
								ИмяПараметра,
								ИмяМетода,
								ОжидаемыйТип,
								ТипЗнч(Значение),
								Значение);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Функция ТипЗначенияСоответствует(Значение, ОжидаемыйТип) Экспорт
	
	ТипОжидаемогоТипа = ТипЗнч(ОжидаемыйТип);
	
	Если ТипОжидаемогоТипа = Тип("Строка") Тогда
		Если СтрНайти(ОжидаемыйТип, ",") Тогда
			ОжидаемыйТип = Новый ОписаниеТипов(ОжидаемыйТип);
			ТипОжидаемогоТипа = Тип("ОписаниеТипов");
		Иначе
			ОжидаемыйТип = Тип(ОжидаемыйТип);
			ТипОжидаемогоТипа = Тип("Тип");
		КонецЕсли;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипОжидаемогоТипа = Тип("ОписаниеТипов") Тогда
		// СодержитТип не подходит, всегда выдает истину если проверяем Тип("Неопределено")
		Соответствует = ОжидаемыйТип.Типы().Найти(ТипЗначения) <> Неопределено
			И ОжидаемыйТип.ПривестиЗначение(Значение) = Значение;
	Иначе
		Соответствует = ТипЗначения = ОжидаемыйТип;
	КонецЕсли;
	
	Возврат Соответствует;
	
КонецФункции

#КонецОбласти
